// WidgetBlueprintGeneratedClass AnnotatedProgressBarNoNumerals_BombTest.
// Size: 0x348 (Inherited: 0x2c8)
struct U : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UImage* ; // 0x2d0(0x08)
	struct UImage* ; // 0x2d8(0x08)
	struct UImage* BG; // 0x2e0(0x08)
	struct UImage* ; // 0x2e8(0x08)
	struct UImage* ; // 0x2f0(0x08)
	struct UHorizontalBox* ; // 0x2f8(0x08)
	struct UImage* Image_134; // 0x300(0x08)
	struct UImage* Image_136; // 0x308(0x08)
	struct UImage* Image_137; // 0x310(0x08)
	struct UImage* Image_138; // 0x318(0x08)
	struct UProgressBar* ProgressBar_1; // 0x320(0x08)
	struct UImage* ; // 0x328(0x08)
	struct FMulticastInlineDelegate NewEventDispatcher_1; // 0x330(0x10)
	float ; // 0x340(0x04)
	float ; // 0x344(0x04)

	void SetProgress(float CurrentValue, float MaxValue); // Function AnnotatedProgressBarNoNumerals_BombTest..SetProgress // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void Construct(); // Function AnnotatedProgressBarNoNumerals_BombTest..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function AnnotatedProgressBarNoNumerals_BombTest..Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function AnnotatedProgressBarNoNumerals_BombTest.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a90
	void NewEventDispatcher_0__DelegateSignature(); // Function AnnotatedProgressBarNoNumerals_BombTest..NewEventDispatcher_0__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
};

