// UserDefinedStruct AresMinimapSlotConfig.AresMinimapSlotConfig
// Size: 0x29 (Inherited: 0x00)
struct FAresMinimapSlotConfig {
	enum class EAresMinimapLayer ; // 0x00(0x01)
	enum class EAresMinimapPositionSpace ; // 0x01(0x01)
	enum class EAresMinimapRotationSpace ; // 0x02(0x01)
	enum class EAresMinimapSizeSpace ; // 0x03(0x01)
	struct FVector ; // 0x04(0x0c)
	float ; // 0x10(0x04)
	struct FVector ; // 0x14(0x0c)
	struct FVector2D ; // 0x20(0x08)
	bool ; // 0x28(0x01)
};

