// WidgetBlueprintGeneratedClass Ceremony_RoundOutcome_Default.
// Size: 0x403 (Inherited: 0x2ce)
struct U : U {
	char pad_2CE[0x2]; // 0x2ce(0x02)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2d0(0x08)
	struct UWidgetAnimation* ; // 0x2d8(0x08)
	struct UWidgetAnimation* ; // 0x2e0(0x08)
	struct UImage* ; // 0x2e8(0x08)
	struct UImage* ; // 0x2f0(0x08)
	struct UImage* ; // 0x2f8(0x08)
	struct UImage* ; // 0x300(0x08)
	struct UImage* ; // 0x308(0x08)
	struct UImage* ; // 0x310(0x08)
	struct UImage* ; // 0x318(0x08)
	struct UImage* ; // 0x320(0x08)
	struct UImage* Ether; // 0x328(0x08)
	struct UImage* ; // 0x330(0x08)
	struct UTextBlock* ; // 0x338(0x08)
	struct UTextBlock* ; // 0x340(0x08)
	struct UTextBlock* ; // 0x348(0x08)
	struct UImage* ; // 0x350(0x08)
	struct UTextBlock* ; // 0x358(0x08)
	struct UImage* ; // 0x360(0x08)
	bool ; // 0x368(0x01)
	char pad_369[0x7]; // 0x369(0x07)
	struct AShooterPlayerState* PlayerState; // 0x370(0x08)
	enum class EAresRoundOutcome RoundOutcome; // 0x378(0x01)
	char pad_379[0x3]; // 0x379(0x03)
	int32_t ; // 0x37c(0x04)
	struct UCoordinatedHUDModel* HUDModel; // 0x380(0x08)
	bool ; // 0x388(0x01)
	char pad_389[0x3]; // 0x389(0x03)
	struct FLinearColor ; // 0x38c(0x10)
	struct FLinearColor ; // 0x39c(0x10)
	char pad_3AC[0x4]; // 0x3ac(0x04)
	struct FSlateColor ; // 0x3b0(0x28)
	struct FSlateColor ; // 0x3d8(0x28)
	bool ; // 0x400(0x01)
	bool ; // 0x401(0x01)
	enum class EAresBombStates BombState; // 0x402(0x01)

	void (struct FLinearColor& Glow, struct FSlateColor& ); // Function Ceremony_RoundOutcome_Default.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (enum class EAresAlliance& ); // Function Ceremony_RoundOutcome_Default.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	struct FText (); // Function Ceremony_RoundOutcome_Default.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	struct FText (); // Function Ceremony_RoundOutcome_Default.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	struct FText (); // Function Ceremony_RoundOutcome_Default.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	void (bool , int32_t , enum class EAresRoundOutcome RoundOutcome); // Function Ceremony_RoundOutcome_Default.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function Ceremony_RoundOutcome_Default.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function Ceremony_RoundOutcome_Default.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void Construct(); // Function Ceremony_RoundOutcome_Default..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (struct AActor* NewViewTarget); // Function Ceremony_RoundOutcome_Default.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function Ceremony_RoundOutcome_Default.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a90
};

