// AnimBlueprintGeneratedClass EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C
// Size: 0xce1 (Inherited: 0x300)
struct UEQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x300(0x08)
	struct FAnimNode_Root ; // 0x308(0x38)
	struct FAnimNode_Slot ; // 0x340(0x50)
	struct FAnimNode_TransitionResult _5; // 0x390(0x28)
	struct FAnimNode_TransitionResult _4; // 0x3b8(0x28)
	struct FAnimNode_TransitionResult _3; // 0x3e0(0x28)
	struct FAnimNode_TransitionResult _2; // 0x408(0x28)
	struct FAnimNode_TransitionResult ; // 0x430(0x28)
	struct FAnimNode_SequencePlayer _8; // 0x458(0x80)
	struct FAnimNode_StateResult _5; // 0x4d8(0x38)
	struct FAnimNode_SequencePlayer _7; // 0x510(0x80)
	struct FAnimNode_StateResult _4; // 0x590(0x38)
	struct FAnimNode_SequencePlayer _6; // 0x5c8(0x80)
	struct FAnimNode_StateResult _3; // 0x648(0x38)
	struct FAnimNode_SequencePlayer _5; // 0x680(0x80)
	struct FAnimNode_TwoWayBlend _2; // 0x700(0xc8)
	struct FAnimNode_SequencePlayer _4; // 0x7c8(0x80)
	struct FAnimNode_StateResult _2; // 0x848(0x38)
	struct FAnimNode_SequencePlayer _3; // 0x880(0x80)
	struct FAnimNode_TwoWayBlend ; // 0x900(0xc8)
	struct FAnimNode_SequencePlayer _2; // 0x9c8(0x80)
	struct FAnimNode_StateResult ; // 0xa48(0x38)
	struct FAnimNode_StateMachine ; // 0xa80(0xe8)
	struct FAnimNode_SequencePlayer ; // 0xb68(0x80)
	struct FAnimNode_ApplyAdditive ; // 0xbe8(0xd0)
	int32_t ; // 0xcb8(0x04)
	bool ; // 0xcbc(0x01)
	char pad_CBD[0x3]; // 0xcbd(0x03)
	float ; // 0xcc0(0x04)
	float AdditivePlayRate; // 0xcc4(0x04)
	float ; // 0xcc8(0x04)
	bool ; // 0xccc(0x01)
	char pad_CCD[0x3]; // 0xccd(0x03)
	float ; // 0xcd0(0x04)
	float ; // 0xcd4(0x04)
	float ; // 0xcd8(0x04)
	float ; // 0xcdc(0x04)
	bool ; // 0xce0(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a90
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C. // (Final|UbergraphFunction) // @ game+0x3322a90
};

