// WidgetBlueprintGeneratedClass FatalVanguardRebootNotification.
// Size: 0x310 (Inherited: 0x2c8)
struct U : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UImage* ; // 0x2d0(0x08)
	struct UTextBlock* ; // 0x2d8(0x08)
	struct UHorizontalBox* ; // 0x2e0(0x08)
	struct UTextBlock* ; // 0x2e8(0x08)
	struct UHorizontalBox* ; // 0x2f0(0x08)
	struct U* ; // 0x2f8(0x08)
	struct U* ; // 0x300(0x08)
	struct UImage* ; // 0x308(0x08)

	void Update(); // Function FatalVanguardRebootNotification..Update // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function FatalVanguardRebootNotification.. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function FatalVanguardRebootNotification.. // (BlueprintEvent) // @ game+0x3322a90
	void Construct(); // Function FatalVanguardRebootNotification..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function FatalVanguardRebootNotification.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a90
};

