// BlueprintGeneratedClass FXC_Spawn_Invulnerability.FXC_Spawn_Invulnerability_C
// Size: 0x568 (Inherited: 0x530)
struct AFXC_Spawn_Invulnerability_C : AEffectContainer {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x530(0x08)
	struct UComp_FXC_SwapMaterials_1P_Overlay_C* Comp_FXC_SwapMaterials_1P_Overlay; // 0x538(0x08)
	struct UComp_FXC_SwapMaterials_C* Comp_FXC_SwapMaterials; // 0x540(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x548(0x08)
	float ; // 0x550(0x04)
	enum class ETimelineDirection ; // 0x554(0x01)
	char pad_555[0x3]; // 0x555(0x03)
	struct UTimelineComponent* ; // 0x558(0x08)
	struct UParticleSystemComponent* ; // 0x560(0x08)

	void (); // Function FXC_Spawn_Invulnerability.FXC_Spawn_Invulnerability_C. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function FXC_Spawn_Invulnerability.FXC_Spawn_Invulnerability_C. // (BlueprintEvent) // @ game+0x3322a90
	void StartEffect(struct AActor* Target, struct UObject* Context, float StartTime, bool FirstPerson); // Function FXC_Spawn_Invulnerability.FXC_Spawn_Invulnerability_C.StartEffect // (Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function FXC_Spawn_Invulnerability.FXC_Spawn_Invulnerability_C. // (Final|UbergraphFunction) // @ game+0x3322a90
};

