// WidgetBlueprintGeneratedClass InitScreen.
// Size: 0x37d (Inherited: 0x2d0)
struct U : U {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2d0(0x08)
	struct UWidgetAnimation* ; // 0x2d8(0x08)
	struct UWidgetAnimation* ; // 0x2e0(0x08)
	struct UWidgetAnimation* ; // 0x2e8(0x08)
	struct UCanvasPanel* ; // 0x2f0(0x08)
	struct UImage* ; // 0x2f8(0x08)
	struct U* FatalVanguardErrorNotification; // 0x300(0x08)
	struct U* FatalVanguardRebootNotification; // 0x308(0x08)
	struct UImage* Image_1; // 0x310(0x08)
	struct U* InitFailure; // 0x318(0x08)
	struct UImage* ; // 0x320(0x08)
	struct U* LoginQueue; // 0x328(0x08)
	struct U* PhotoSensitivityWarning; // 0x330(0x08)
	struct UImage* ; // 0x338(0x08)
	struct UOverlay* ; // 0x340(0x08)
	struct USizeBox* ; // 0x348(0x08)
	struct UCanvasPanel* ; // 0x350(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_2; // 0x358(0x08)
	bool ; // 0x360(0x01)
	char pad_361[0x3]; // 0x361(0x03)
	struct FName ; // 0x364(0x0c)
	struct FName ; // 0x370(0x0c)
	bool ; // 0x37c(0x01)

	void _1(); // Function InitScreen.._1 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function InitScreen.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function InitScreen.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function InitScreen.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void _1(); // Function InitScreen.._1 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (struct UWidget*& NewParam); // Function InitScreen.. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	void (struct UWidget*& Widget); // Function InitScreen.. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	void OnAnimationFinished(struct UWidgetAnimation* Animation); // Function InitScreen..OnAnimationFinished // (BlueprintCosmetic|Event|Protected|BlueprintEvent) // @ game+0x3322a90
	void (); // Function InitScreen.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function InitScreen.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void Construct(); // Function InitScreen..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function InitScreen.. // (Final|UbergraphFunction) // @ game+0x3322a90
};

