// WidgetBlueprintGeneratedClass InitFailure.
// Size: 0x308 (Inherited: 0x2c8)
struct U : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UImage* ; // 0x2d0(0x08)
	struct UTextBlock* ErrorCode; // 0x2d8(0x08)
	struct UTextBlock* ; // 0x2e0(0x08)
	struct U* InitDirectConnect; // 0x2e8(0x08)
	struct U* ; // 0x2f0(0x08)
	struct U* ; // 0x2f8(0x08)
	struct UTextBlock* ; // 0x300(0x08)

	void (enum class ESlateVisibility& ); // Function InitFailure.. // (Private|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	void (struct FText& ); // Function InitFailure.. // (Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	void (); // Function InitFailure.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (struct FText& ); // Function InitFailure.. // (Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	void (struct FText& ); // Function InitFailure.. // (Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	void Construct(); // Function InitFailure..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (); // Function InitFailure.. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function InitFailure.. // (BlueprintEvent) // @ game+0x3322a90
	void OnSignoutAllowed(); // Function InitFailure..OnSignoutAllowed // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void OnSignoutNotAllowed(); // Function InitFailure..OnSignoutNotAllowed // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function InitFailure.. // (Final|UbergraphFunction) // @ game+0x3322a90
};

