// WidgetBlueprintGeneratedClass JanusLineWidget.
// Size: 0x350 (Inherited: 0x2c8)
struct U : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UAresTextBlock* AresTextBlock_432; // 0x2d0(0x08)
	struct UAresTextBlock* AresTextBlock_737; // 0x2d8(0x08)
	struct UAresWidgetSwitcher* AresWidgetSwitcher_1751; // 0x2e0(0x08)
	struct UButton* ; // 0x2e8(0x08)
	struct UImage* Image; // 0x2f0(0x08)
	struct UImage* Image_3; // 0x2f8(0x08)
	struct UImage* Image_158; // 0x300(0x08)
	struct UButton* ; // 0x308(0x08)
	struct UImage* ; // 0x310(0x08)
	struct UTextBlock* TextBlock_607; // 0x318(0x08)
	struct USlider* ; // 0x320(0x08)
	float ; // 0x328(0x04)
	bool ; // 0x32c(0x01)
	bool ; // 0x32d(0x01)
	char pad_32E[0x2]; // 0x32e(0x02)
	float ; // 0x330(0x04)
	float ; // 0x334(0x04)
	struct ABaseJanusController_C* NewVar_1; // 0x338(0x08)
	struct FMulticastInlineDelegate NewEventDispatcher_1; // 0x340(0x10)

	void (); // Function JanusLineWidget.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	bool _1(); // Function JanusLineWidget.._1 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	struct FText (); // Function JanusLineWidget.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	bool _1(); // Function JanusLineWidget.._1 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	struct FText (float Time); // Function JanusLineWidget.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	struct FText (); // Function JanusLineWidget.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	struct FText (); // Function JanusLineWidget.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a90
	void (); // Function JanusLineWidget.. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function JanusLineWidget.. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function JanusLineWidget.. // (BlueprintEvent) // @ game+0x3322a90
	void (); // Function JanusLineWidget.. // (BlueprintEvent) // @ game+0x3322a90
	void (float Value); // Function JanusLineWidget.. // (BlueprintEvent) // @ game+0x3322a90
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function JanusLineWidget..Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (); // Function JanusLineWidget.. // (BlueprintEvent) // @ game+0x3322a90
	void Construct(); // Function JanusLineWidget..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (); // Function JanusLineWidget.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function JanusLineWidget.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a90
	void NewEventDispatcher_0__DelegateSignature(); // Function JanusLineWidget..NewEventDispatcher_0__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
};

