// WidgetBlueprintGeneratedClass LoadingThrobberSmall.
// Size: 0x338 (Inherited: 0x2c8)
struct U : UDesignableUserWidget {
	struct UWidgetAnimation* hover; // 0x2c8(0x08)
	struct UImage* ; // 0x2d0(0x08)
	struct UImage* ; // 0x2d8(0x08)
	struct UImage* ; // 0x2e0(0x08)
	struct UImage* Border; // 0x2e8(0x08)
	struct UImage* ; // 0x2f0(0x08)
	struct UImage* ; // 0x2f8(0x08)
	struct UImage* ; // 0x300(0x08)
	struct FLinearColor ; // 0x308(0x10)
	struct FMulticastInlineDelegate OnClicked; // 0x318(0x10)
	struct FMulticastInlineDelegate OnHovered; // 0x328(0x10)

	void (struct U* ); // Function LoadingThrobberSmall.. // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (struct U* ); // Function LoadingThrobberSmall.. // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
};

