// WidgetBlueprintGeneratedClass PingTextWidget.
// Size: 0x338 (Inherited: 0x2c8)
struct U : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UTextBlock* Distance; // 0x2d0(0x08)
	struct UTextBlock* Meters; // 0x2d8(0x08)
	struct UTextBlock* Region; // 0x2e0(0x08)
	struct UTextBlock* Subject; // 0x2e8(0x08)
	struct FText ; // 0x2f0(0x18)
	struct FText ; // 0x308(0x18)
	struct FText ; // 0x320(0x18)

	void Construct(); // Function PingTextWidget..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void PreConstruct(bool IsDesignTime); // Function PingTextWidget..PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function PingTextWidget.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a90
};

