// UserDefinedStruct QueuedVOLine.QueuedVOLine
// Size: 0x38 (Inherited: 0x00)
struct FQueuedVOLine {
	struct UAkAudioEvent* ; // 0x00(0x08)
	enum class VOPriorityEnum ; // 0x08(0x01)
	char pad_9[0x3]; // 0x09(0x03)
	float ; // 0x0c(0x04)
	float ; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct TArray<struct FAkSwitch> ; // 0x18(0x10)
	bool ; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	int32_t ; // 0x2c(0x04)
	struct UBaseVOComponent_C* ; // 0x30(0x08)
};

