// WidgetBlueprintGeneratedClass UniversalChargeBar.
// Size: 0x380 (Inherited: 0x2c8)
struct U : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UNamedSlot* ; // 0x2d0(0x08)
	struct UImage* BG; // 0x2d8(0x08)
	struct UImage* ; // 0x2e0(0x08)
	struct UImage* ; // 0x2e8(0x08)
	struct UTextBlock* ; // 0x2f0(0x08)
	struct UProgressBar* ; // 0x2f8(0x08)
	struct UHorizontalBox* ; // 0x300(0x08)
	struct UImage* Image_160; // 0x308(0x08)
	struct UImage* Image_162; // 0x310(0x08)
	struct UImage* Image_163; // 0x318(0x08)
	struct UImage* Image_164; // 0x320(0x08)
	struct UImage* Image_165; // 0x328(0x08)
	struct UImage* Image_166; // 0x330(0x08)
	struct UImage* Image_167; // 0x338(0x08)
	struct UImage* Image_168; // 0x340(0x08)
	struct UNamedSlot* ; // 0x348(0x08)
	struct UImage* ; // 0x350(0x08)
	struct UImage* ; // 0x358(0x08)
	struct UImage* ; // 0x360(0x08)
	struct FText ; // 0x368(0x18)

	void (float ); // Function UniversalChargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (struct FText InText); // Function UniversalChargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (int32_t ); // Function UniversalChargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (struct FLinearColor InColor); // Function UniversalChargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function UniversalChargeBar.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a90
};

