// WidgetBlueprintGeneratedClass Widget_Ability_Element_RechargeBar.
// Size: 0x394 (Inherited: 0x358)
struct U : UCharacterAbilityWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x358(0x08)
	struct UBorder* Border_167; // 0x360(0x08)
	struct UProgressBar* ; // 0x368(0x08)
	struct UImage* ; // 0x370(0x08)
	struct FTimerHandle ; // 0x378(0x08)
	float ; // 0x380(0x04)
	char pad_384[0x4]; // 0x384(0x04)
	struct FTimerHandle ; // 0x388(0x08)
	float ; // 0x390(0x04)

	void (bool ); // Function Widget_Ability_Element_RechargeBar.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void Construct(); // Function Widget_Ability_Element_RechargeBar..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a90
	void (bool ); // Function Widget_Ability_Element_RechargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function Widget_Ability_Element_RechargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (float TotalTime, float , bool ); // Function Widget_Ability_Element_RechargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function Widget_Ability_Element_RechargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function Widget_Ability_Element_RechargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (bool ); // Function Widget_Ability_Element_RechargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (); // Function Widget_Ability_Element_RechargeBar.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a90
	void (int32_t EntryPoint); // Function Widget_Ability_Element_RechargeBar.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a90
};

