// BlueprintGeneratedClass FXC_Spawn_Invulnerability.FXC_Spawn_Invulnerability_C
// Size: 0x568 (Inherited: 0x530)
struct AFXC_Spawn_Invulnerability_C : AEffectContainer {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x530(0x08)
	struct UComp_FXC_SwapMaterials_1P_Overlay_C* Comp_FXC_SwapMaterials_1P_Overlay; // 0x538(0x08)
	struct UComp_FXC_SwapMaterials_C* Comp_FXC_SwapMaterials; // 0x540(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x548(0x08)
	float FadeInTimeline_Dissolve_E68EC8EC478D8526BA95AD8111E22160; // 0x550(0x04)
	enum class ETimelineDirection FadeInTimeline__Direction_E68EC8EC478D8526BA95AD8111E22160; // 0x554(0x01)
	char pad_555[0x3]; // 0x555(0x03)
	struct UTimelineComponent* FadeInTimeline; // 0x558(0x08)
	struct UParticleSystemComponent* HUDVFX; // 0x560(0x08)

	void FadeInTimeline__FinishedFunc(); // Function FXC_Spawn_Invulnerability.FXC_Spawn_Invulnerability_C.FadeInTimeline__FinishedFunc // (BlueprintEvent) // @ game+0x3520f50
	void FadeInTimeline__UpdateFunc(); // Function FXC_Spawn_Invulnerability.FXC_Spawn_Invulnerability_C.FadeInTimeline__UpdateFunc // (BlueprintEvent) // @ game+0x3520f50
	void StartEffect(struct AActor* Target, struct UObject* Context, float StartTime, bool FirstPerson); // Function FXC_Spawn_Invulnerability.FXC_Spawn_Invulnerability_C.StartEffect // (Event|Public|BlueprintEvent) // @ game+0x3520f50
	void ExecuteUbergraph_FXC_Spawn_Invulnerability(int32_t EntryPoint); // Function FXC_Spawn_Invulnerability.FXC_Spawn_Invulnerability_C.ExecuteUbergraph_FXC_Spawn_Invulnerability // (Final|UbergraphFunction) // @ game+0x3520f50
};

