// WidgetBlueprintGeneratedClass Announcement_ULTReady.
// Size: 0x480 (Inherited: 0x2ce)
struct U : U {
	char pad_2CE[0x2]; // 0x2ce(0x02)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2d0(0x08)
	struct UWidgetAnimation* _1; // 0x2d8(0x08)
	struct UWidgetAnimation* _1; // 0x2e0(0x08)
	struct UImage* ; // 0x2e8(0x08)
	struct UImage* ; // 0x2f0(0x08)
	struct UBorder* BrushNormal; // 0x2f8(0x08)
	struct UImage* Ether; // 0x300(0x08)
	struct UImage* ; // 0x308(0x08)
	struct UTextBlock* ; // 0x310(0x08)
	struct UImage* ; // 0x318(0x08)
	struct UTextBlock* ; // 0x320(0x08)
	struct UImage* ; // 0x328(0x08)
	struct AShooterCharacter* Character; // 0x330(0x08)
	struct FText ; // 0x338(0x18)
	struct AActor* ; // 0x350(0x08)
	struct FText Money; // 0x358(0x18)
	struct FText RoundNumber; // 0x370(0x18)
	struct FText Objective; // 0x388(0x18)
	struct FText ; // 0x3a0(0x18)
	struct FText ; // 0x3b8(0x18)
	struct UMaterialInstance* ; // 0x3d0(0x08)
	struct FSlateBrush ; // 0x3d8(0x90)
	struct FText ; // 0x468(0x18)

	void SetIcon(); // Function Announcement_ULTReady..SetIcon // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct AActor* Actor, struct FText& ); // Function Announcement_ULTReady.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct AShooterPlayerState* State, struct FText& Name); // Function Announcement_ULTReady.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void (struct UImage* Widget, struct UTexture* Texture); // Function Announcement_ULTReady.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void Construct(); // Function Announcement_ULTReady..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Announcement_ULTReady.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Announcement_ULTReady.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function Announcement_ULTReady.. // (Final|UbergraphFunction) // @ game+0x3322a60
};

