// BlueprintGeneratedClass AresHUD.AresHUD_C
// Size: 0xa90 (Inherited: 0xa60)
struct AAresHUD_C : AShooterHUD {
	struct USceneComponent* DefaultSceneRoot; // 0xa60(0x08)
	float ; // 0xa68(0x04)
	float ; // 0xa6c(0x04)
	float ; // 0xa70(0x04)
	float ; // 0xa74(0x04)
	float ; // 0xa78(0x04)
	char pad_A7C[0x4]; // 0xa7c(0x04)
	struct TArray<struct AShooterCharacter*> ; // 0xa80(0x10)
};

