// WidgetBlueprintGeneratedClass BaseTimerRingNotificationWidget.
// Size: 0x360 (Inherited: 0x310)
struct U : U {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x310(0x08)
	struct UImage* ; // 0x318(0x08)
	float ; // 0x320(0x04)
	struct FLinearColor ; // 0x324(0x10)
	char pad_334[0x4]; // 0x334(0x04)
	struct UMaterialInstanceDynamic* ; // 0x338(0x08)
	struct FLinearColor ; // 0x340(0x10)
	struct FLinearColor ; // 0x350(0x10)

	void (float CurrentValue, float MaxValue); // Function BaseTimerRingNotificationWidget.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void PreConstruct(bool IsDesignTime); // Function BaseTimerRingNotificationWidget..PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void Construct(); // Function BaseTimerRingNotificationWidget..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function BaseTimerRingNotificationWidget.. // (Final|UbergraphFunction) // @ game+0x3322a60
};

