// WidgetBlueprintGeneratedClass BombIcon.
// Size: 0x368 (Inherited: 0x2ce)
struct U : U {
	char pad_2CE[0x2]; // 0x2ce(0x02)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2d0(0x08)
	struct UWidgetAnimation* ; // 0x2d8(0x08)
	struct UWidgetAnimation* ; // 0x2e0(0x08)
	struct UWidgetAnimation* ; // 0x2e8(0x08)
	struct UWidgetAnimation* ; // 0x2f0(0x08)
	struct UWidgetAnimation* ; // 0x2f8(0x08)
	struct UWidgetAnimation* ; // 0x300(0x08)
	struct UWidgetAnimation* ; // 0x308(0x08)
	struct UImage* ; // 0x310(0x08)
	struct UImage* ; // 0x318(0x08)
	struct UImage* CharacterIcon; // 0x320(0x08)
	struct UImage* ; // 0x328(0x08)
	struct UImage* ; // 0x330(0x08)
	struct UImage* ; // 0x338(0x08)
	struct UImage* ; // 0x340(0x08)
	struct UOverlay* ; // 0x348(0x08)
	struct UTextBlock* ; // 0x350(0x08)
	struct AShooterCharacter* Character; // 0x358(0x08)
	struct UObject* ; // 0x360(0x08)

	void (struct AShooterCharacter* InCharacter); // Function BombIcon.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void Construct(); // Function BombIcon..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function BombIcon..Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (); // Function BombIcon.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function BombIcon.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function BombIcon.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function BombIcon.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function BombIcon.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function BombIcon.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function BombIcon.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function BombIcon.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a60
};

