// WidgetBlueprintGeneratedClass Ceremony_Generic_Default.
// Size: 0x3f0 (Inherited: 0x2ce)
struct U : U {
	char pad_2CE[0x2]; // 0x2ce(0x02)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2d0(0x08)
	struct UWidgetAnimation* ; // 0x2d8(0x08)
	struct UImage* ; // 0x2e0(0x08)
	struct UImage* ; // 0x2e8(0x08)
	struct U* Ceremony_RoundOutcome_Default; // 0x2f0(0x08)
	struct UImage* ; // 0x2f8(0x08)
	struct UCanvasPanel* ; // 0x300(0x08)
	struct UImage* ; // 0x308(0x08)
	struct UImage* ; // 0x310(0x08)
	struct UImage* ; // 0x318(0x08)
	struct UImage* ; // 0x320(0x08)
	struct UImage* ; // 0x328(0x08)
	struct UImage* ; // 0x330(0x08)
	struct UImage* Image_55; // 0x338(0x08)
	struct UImage* Image_109; // 0x340(0x08)
	struct UTextBlock* PlayerName; // 0x348(0x08)
	struct UTextBlock* ; // 0x350(0x08)
	struct UTextBlock* ; // 0x358(0x08)
	struct UImage* Texture; // 0x360(0x08)
	struct UCanvasPanel* ; // 0x368(0x08)
	struct UCanvasPanel* ; // 0x370(0x08)
	struct UImage* ; // 0x378(0x08)
	struct UImage* ; // 0x380(0x08)
	struct UImage* ; // 0x388(0x08)
	struct UTextBlock* ; // 0x390(0x08)
	struct FText ; // 0x398(0x18)
	struct AShooterPlayerState* PlayerState; // 0x3b0(0x08)
	struct UBaseTeamComponent* ; // 0x3b8(0x08)
	struct FText ; // 0x3c0(0x18)
	bool ; // 0x3d8(0x01)
	char pad_3D9[0x3]; // 0x3d9(0x03)
	int32_t ; // 0x3dc(0x04)
	enum class EAresRoundOutcome RoundOutcome; // 0x3e0(0x01)
	char pad_3E1[0x3]; // 0x3e1(0x03)
	int32_t Tier; // 0x3e4(0x04)
	struct UTexture* ; // 0x3e8(0x08)

	struct FSlateBrush _1(); // Function Ceremony_Generic_Default.._1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void (struct AShooterPlayerState* Player State); // Function Ceremony_Generic_Default.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Ceremony_Generic_Default.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct AShooterPlayerState* State, struct FText& Name); // Function Ceremony_Generic_Default.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void Construct(); // Function Ceremony_Generic_Default..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Ceremony_Generic_Default.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Ceremony_Generic_Default.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Ceremony_Generic_Default.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function Ceremony_Generic_Default.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a60
};

