// WidgetBlueprintGeneratedClass ConfirmationModal.
// Size: 0x510 (Inherited: 0x478)
struct U : U {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x478(0x08)
	struct USpacer* ; // 0x480(0x08)
	struct UNamedSlot* CustomBody; // 0x488(0x08)
	struct UWidgetSwitcher* ; // 0x490(0x08)
	struct UImage* Image_1; // 0x498(0x08)
	struct UImage* Image_2; // 0x4a0(0x08)
	struct UImage* Image_3; // 0x4a8(0x08)
	struct UImage* Image_4; // 0x4b0(0x08)
	struct UImage* Image_5; // 0x4b8(0x08)
	struct U* ; // 0x4c0(0x08)
	struct UTextBlock* Message; // 0x4c8(0x08)
	struct U* ; // 0x4d0(0x08)
	struct USpacer* ; // 0x4d8(0x08)
	struct U* ; // 0x4e0(0x08)
	struct U* SharedBackButton; // 0x4e8(0x08)
	struct USizeBox* _2; // 0x4f0(0x08)
	struct USizeBox* ; // 0x4f8(0x08)
	struct USizeBox* ; // 0x500(0x08)
	struct UTextBlock* Title; // 0x508(0x08)

	struct FEventReply OnKeyDown(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function ConfirmationModal..OnKeyDown // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	struct FEventReply OnKeyUp(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function ConfirmationModal..OnKeyUp // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	bool HandleBackRequest(); // Function ConfirmationModal..HandleBackRequest // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (enum class EAresNotificationType NotificationType, struct UModalNotificationColors_C*& Colors); // Function ConfirmationModal.. // (Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void Construct(); // Function ConfirmationModal..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void Destruct(); // Function ConfirmationModal..Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void PreConstruct(bool IsDesignTime); // Function ConfirmationModal..PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (); // Function ConfirmationModal.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function ConfirmationModal.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function ConfirmationModal.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function ConfirmationModal.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function ConfirmationModal.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function ConfirmationModal.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function ConfirmationModal.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function ConfirmationModal.. // (Final|UbergraphFunction) // @ game+0x3322a60
};

