// AnimBlueprintGeneratedClass Gun_Core_AnimGraph.Gun_Core_AnimGraph_C
// Size: 0xe3c (Inherited: 0x520)
struct UGun_Core_AnimGraph_C : UAresEquippableAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x520(0x08)
	struct FAnimNode_Root ; // 0x528(0x38)
	struct FAnimNode_BlendListByBool ; // 0x560(0xa0)
	struct FAnimNode_Slot ; // 0x600(0x50)
	struct FAnimNode_TransitionResult _13; // 0x650(0x28)
	struct FAnimNode_TransitionResult _12; // 0x678(0x28)
	struct FAnimNode_TransitionResult _11; // 0x6a0(0x28)
	struct FAnimNode_TransitionResult _10; // 0x6c8(0x28)
	struct FAnimNode_TransitionResult _9; // 0x6f0(0x28)
	struct FAnimNode_TransitionResult _8; // 0x718(0x28)
	struct FAnimNode_TransitionResult _7; // 0x740(0x28)
	struct FAnimNode_TransitionResult _6; // 0x768(0x28)
	struct FAnimNode_TransitionResult _5; // 0x790(0x28)
	struct FAnimNode_TransitionResult _4; // 0x7b8(0x28)
	struct FAnimNode_SequencePlayer _5; // 0x7e0(0x80)
	struct FAnimNode_StateResult _7; // 0x860(0x38)
	struct FAnimNode_SequencePlayer _4; // 0x898(0x80)
	struct FAnimNode_StateResult _6; // 0x918(0x38)
	struct FAnimNode_SequencePlayer _3; // 0x950(0x80)
	struct FAnimNode_StateResult _5; // 0x9d0(0x38)
	struct FAnimNode_TransitionResult _3; // 0xa08(0x28)
	struct FAnimNode_SequencePlayer _2; // 0xa30(0x80)
	struct FAnimNode_StateResult _4; // 0xab0(0x38)
	struct FAnimNode_SequencePlayer ; // 0xae8(0x80)
	struct FAnimNode_StateResult _3; // 0xb68(0x38)
	struct FAnimNode_StateMachine _2; // 0xba0(0xe8)
	struct FAnimNode_TransitionResult _2; // 0xc88(0x28)
	struct FAnimNode_TransitionResult ; // 0xcb0(0x28)
	struct FAnimNode_StateResult _2; // 0xcd8(0x38)
	struct FAnimNode_StateResult ; // 0xd10(0x38)
	struct FAnimNode_StateMachine ; // 0xd48(0xe8)
	struct FRotator ; // 0xe30(0x0c)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (BlueprintEvent) // @ game+0x3322a60
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C. // (Final|UbergraphFunction) // @ game+0x3322a60
};

