// UserDefinedStruct GunSkinParticleInfo.GunSkinParticleInfo
// Size: 0x7e (Inherited: 0x00)
struct FGunSkinParticleInfo {
	struct TSoftObjectPtr<UParticleSystem> ; // 0x00(0x30)
	struct FName ; // 0x30(0x0c)
	struct FVector ; // 0x3c(0x0c)
	struct FRotator ; // 0x48(0x0c)
	enum class ELHMMirroringIgnoreType ; // 0x54(0x01)
	bool ; // 0x55(0x01)
	char pad_56[0x2]; // 0x56(0x02)
	int32_t ; // 0x58(0x04)
	bool ; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
	struct TArray<struct FStruct_ParticleOverrides> ; // 0x60(0x10)
	bool ; // 0x70(0x01)
	bool ; // 0x71(0x01)
	bool ; // 0x72(0x01)
	bool ; // 0x73(0x01)
	bool ; // 0x74(0x01)
	bool ; // 0x75(0x01)
	char pad_76[0x2]; // 0x76(0x02)
	float ; // 0x78(0x04)
	enum class EAresParticleVariantColor ; // 0x7c(0x01)
	enum class EAres_ParticleTimeDilationOverrideBehaviour ; // 0x7d(0x01)
};

