// WidgetBlueprintGeneratedClass LoginQueue.
// Size: 0x308 (Inherited: 0x2c8)
struct U : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UImage* ; // 0x2d0(0x08)
	struct U* ; // 0x2d8(0x08)
	struct U* ; // 0x2e0(0x08)
	struct UTextBlock* ; // 0x2e8(0x08)
	struct UTextBlock* ; // 0x2f0(0x08)
	int32_t ; // 0x2f8(0x04)
	int32_t ; // 0x2fc(0x04)
	struct FTimerHandle ; // 0x300(0x08)

	void (); // Function LoginQueue.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function LoginQueue.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void Construct(); // Function LoginQueue..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void OnQueueUpdated(); // Function LoginQueue..OnQueueUpdated // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void OnLoginReady(); // Function LoginQueue..OnLoginReady // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function LoginQueue.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function LoginQueue.. // (BlueprintEvent) // @ game+0x3322a60
	void OnSignoutAllowed(); // Function LoginQueue..OnSignoutAllowed // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void OnSignoutNotAllowed(); // Function LoginQueue..OnSignoutNotAllowed // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function LoginQueue.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a60
};

