// WidgetBlueprintGeneratedClass SharedBackButton.
// Size: 0x39b (Inherited: 0x2c8)
struct U : UDesignableUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UWidgetAnimation* ; // 0x2d0(0x08)
	struct UImage* ; // 0x2d8(0x08)
	struct UImage* ; // 0x2e0(0x08)
	struct UButton* ; // 0x2e8(0x08)
	struct UHorizontalBox* ; // 0x2f0(0x08)
	struct UButton* ; // 0x2f8(0x08)
	struct UImage* ; // 0x300(0x08)
	struct UHorizontalBox* ; // 0x308(0x08)
	struct UImage* ; // 0x310(0x08)
	struct UImage* ; // 0x318(0x08)
	struct UHorizontalBox* ; // 0x320(0x08)
	struct UImage* Image_406; // 0x328(0x08)
	struct UVerticalBox* ; // 0x330(0x08)
	struct UOverlay* ; // 0x338(0x08)
	struct UOverlay* _2; // 0x340(0x08)
	struct UTextBlock* ; // 0x348(0x08)
	struct UTextBlock* ; // 0x350(0x08)
	struct UMenuAnchor* MenuAnchor_127; // 0x358(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_1; // 0x360(0x08)
	struct FMulticastInlineDelegate ; // 0x368(0x10)
	bool ; // 0x378(0x01)
	char pad_379[0x7]; // 0x379(0x07)
	struct UAkAudioEvent* ; // 0x380(0x08)
	struct UAkAudioEvent* ; // 0x388(0x08)
	struct UAkAudioEvent* ; // 0x390(0x08)
	bool ; // 0x398(0x01)
	enum class SharedBackButtonTypes ; // 0x399(0x01)
	bool ; // 0x39a(0x01)

	struct UWidget* (); // Function SharedBackButton.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function SharedBackButton..Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (); // Function SharedBackButton.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function SharedBackButton.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function SharedBackButton.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function SharedBackButton.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function SharedBackButton.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function SharedBackButton.. // (BlueprintEvent) // @ game+0x3322a60
	void OnSynchronizeProperties(); // Function SharedBackButton..OnSynchronizeProperties // (Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function SharedBackButton.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a60
	void (); // Function SharedBackButton.. // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
};

