// WidgetBlueprintGeneratedClass Shared_Mouse_Prompt.
// Size: 0x348 (Inherited: 0x2c8)
struct U : UDesignableUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UInvalidationBox* ; // 0x2d0(0x08)
	struct UImage* ; // 0x2d8(0x08)
	struct UImage* _2; // 0x2e0(0x08)
	struct UImage* ; // 0x2e8(0x08)
	struct UImage* ; // 0x2f0(0x08)
	struct UImage* ; // 0x2f8(0x08)
	struct UImage* ; // 0x300(0x08)
	struct UImage* ; // 0x308(0x08)
	struct UImage* ; // 0x310(0x08)
	struct UImage* ; // 0x318(0x08)
	struct UImage* ; // 0x320(0x08)
	struct UImage* ; // 0x328(0x08)
	struct UImage* ; // 0x330(0x08)
	bool ; // 0x338(0x01)
	bool ; // 0x339(0x01)
	bool ; // 0x33a(0x01)
	bool ; // 0x33b(0x01)
	bool ; // 0x33c(0x01)
	char pad_33D[0x3]; // 0x33d(0x03)
	struct UImage* ; // 0x340(0x08)

	void (); // Function Shared_Mouse_Prompt.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void PreConstruct(bool IsDesignTime); // Function Shared_Mouse_Prompt..PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void Construct(); // Function Shared_Mouse_Prompt..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void OnSynchronizeProperties(); // Function Shared_Mouse_Prompt..OnSynchronizeProperties // (Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (enum class Enum_AbilityInputs ); // Function Shared_Mouse_Prompt.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function Shared_Mouse_Prompt.. // (Final|UbergraphFunction) // @ game+0x3322a60
};

