// WidgetBlueprintGeneratedClass SignatureAbilityRechargedAnnouncementWidget.
// Size: 0x328 (Inherited: 0x2ce)
struct U : U {
	char pad_2CE[0x2]; // 0x2ce(0x02)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2d0(0x08)
	struct UWidgetAnimation* ; // 0x2d8(0x08)
	struct UWidgetAnimation* ; // 0x2e0(0x08)
	struct UImage* ; // 0x2e8(0x08)
	struct UImage* Image_72; // 0x2f0(0x08)
	struct UImage* L; // 0x2f8(0x08)
	struct UTextBlock* ; // 0x300(0x08)
	struct UImage* R; // 0x308(0x08)
	struct USizeBox* SizeBox_1; // 0x310(0x08)
	struct AShooterCharacter* Character; // 0x318(0x08)
	struct AActor* ; // 0x320(0x08)

	void (); // Function SignatureAbilityRechargedAnnouncementWidget.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct AActor* Actor, struct FText& ); // Function SignatureAbilityRechargedAnnouncementWidget.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct AShooterPlayerState* State, struct FText& Name); // Function SignatureAbilityRechargedAnnouncementWidget.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void (struct UImage* Widget, struct UTexture* Texture); // Function SignatureAbilityRechargedAnnouncementWidget.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void Construct(); // Function SignatureAbilityRechargedAnnouncementWidget..Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (); // Function SignatureAbilityRechargedAnnouncementWidget.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function SignatureAbilityRechargedAnnouncementWidget.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function SignatureAbilityRechargedAnnouncementWidget.. // (Final|UbergraphFunction) // @ game+0x3322a60
};

