// WidgetBlueprintGeneratedClass Widget_Ability_Standard.
// Size: 0x459 (Inherited: 0x360)
struct U : U {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x360(0x08)
	struct UWidgetAnimation* ; // 0x368(0x08)
	struct UNamedSlot* ; // 0x370(0x08)
	struct UImage* ; // 0x378(0x08)
	struct UImage* ; // 0x380(0x08)
	struct U* GamepadInputPromptSwitcher; // 0x388(0x08)
	struct UBorder* ; // 0x390(0x08)
	struct UHorizontalBox* ; // 0x398(0x08)
	struct UOverlay* Main; // 0x3a0(0x08)
	struct UNamedSlot* ; // 0x3a8(0x08)
	struct UImage* _2; // 0x3b0(0x08)
	struct UImage* Spacer; // 0x3b8(0x08)
	struct UImage* ; // 0x3c0(0x08)
	struct UVerticalBox* ; // 0x3c8(0x08)
	struct UImage* ; // 0x3d0(0x08)
	struct U* ; // 0x3d8(0x08)
	struct U* Widget_Ability_Element_InputPrompt; // 0x3e0(0x08)
	struct U* Widget_Ability_Element_Signature_Cooldown; // 0x3e8(0x08)
	struct U* Widget_Ability_Element_Timer; // 0x3f0(0x08)
	struct U* ; // 0x3f8(0x08)
	struct U* _1; // 0x400(0x08)
	float ; // 0x408(0x04)
	char pad_40C[0x4]; // 0x40c(0x04)
	struct FTimerHandle ; // 0x410(0x08)
	struct FTimerHandle ; // 0x418(0x08)
	float ; // 0x420(0x04)
	float ; // 0x424(0x04)
	float ; // 0x428(0x04)
	float ; // 0x42c(0x04)
	float ; // 0x430(0x04)
	float ; // 0x434(0x04)
	float ; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct FTimerHandle ; // 0x440(0x08)
	float ; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
	struct UMaterialInstance* ; // 0x450(0x08)
	bool ; // 0x458(0x01)

	void (); // Function Widget_Ability_Standard.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Standard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Standard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Standard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (float StartTime, float Duration, struct FTimerHandle& TimerHandle, struct UImage* Icon); // Function Widget_Ability_Standard.. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct UWidget* Content); // Function Widget_Ability_Standard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct TArray<struct UWidget*>& Array, struct U*& ); // Function Widget_Ability_Standard.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct TArray<struct UWidget*>& ); // Function Widget_Ability_Standard.. // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void OnStartWidget(); // Function Widget_Ability_Standard..OnStartWidget // (BlueprintCosmetic|Event|Protected|BlueprintEvent) // @ game+0x3322a60
	void (struct UUserWidget* ); // Function Widget_Ability_Standard.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct UUserWidget* ); // Function Widget_Ability_Standard.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void _1(); // Function Widget_Ability_Standard.._1 // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void _1(); // Function Widget_Ability_Standard.._1 // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void PreConstruct(bool IsDesignTime); // Function Widget_Ability_Standard..PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Standard.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Standard.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Standard.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Standard.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Standard.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Standard.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Standard.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void OnInitialized(); // Function Widget_Ability_Standard..OnInitialized // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function Widget_Ability_Standard.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a60
};

