// WidgetBlueprintGeneratedClass Widget_Ability_Element_Icon.
// Size: 0x3b0 (Inherited: 0x358)
struct U : UCharacterAbilityWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x358(0x08)
	struct UImage* ; // 0x360(0x08)
	struct UProgressBar* ProgressBar; // 0x368(0x08)
	struct UButton* ; // 0x370(0x08)
	struct FMulticastInlineDelegate ; // 0x378(0x10)
	struct UMaterialInstance* ; // 0x388(0x08)
	struct UTexture* ; // 0x390(0x08)
	struct UTexture* ; // 0x398(0x08)
	struct UMaterialInstance* ; // 0x3a0(0x08)
	struct UMaterialInstanceDynamic* ; // 0x3a8(0x08)

	void (); // Function Widget_Ability_Element_Icon.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void SetReady(); // Function Widget_Ability_Element_Icon..SetReady // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_Icon.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void GetItemIcon(struct UTexture*& Icon); // Function Widget_Ability_Element_Icon..GetItemIcon // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void SetIcon(); // Function Widget_Ability_Element_Icon..SetIcon // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_Icon.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct UUserWidget* ); // Function Widget_Ability_Element_Icon.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct UUserWidget* ); // Function Widget_Ability_Element_Icon.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_Icon.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void OnStartWidget(); // Function Widget_Ability_Element_Icon..OnStartWidget // (BlueprintCosmetic|Event|Protected|BlueprintEvent) // @ game+0x3322a60
	void _1(); // Function Widget_Ability_Element_Icon.._1 // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_Icon.. // (BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_Icon.. // (BlueprintEvent) // @ game+0x3322a60
	void OverrideIcon(struct UTexture* OverrideTexture); // Function Widget_Ability_Element_Icon..OverrideIcon // (BlueprintCosmetic|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct UCharacterHandle* CharacterHandle); // Function Widget_Ability_Element_Icon.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct FStruct_GameplayTagAndHUD_Info TagInfo); // Function Widget_Ability_Element_Icon.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct FStruct_GameplayTagAndHUD_Info TagInfo); // Function Widget_Ability_Element_Icon.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function Widget_Ability_Element_Icon.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_Icon.. // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
};

