// WidgetBlueprintGeneratedClass Widget_Ability_Element_Signature_KillCounter.
// Size: 0x3f4 (Inherited: 0x360)
struct U : U {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x360(0x08)
	struct UWidgetAnimation* ; // 0x368(0x08)
	struct UWidgetAnimation* ; // 0x370(0x08)
	struct UWidgetAnimation* Ready; // 0x378(0x08)
	struct UWidgetAnimation* Normal; // 0x380(0x08)
	struct U* ; // 0x388(0x08)
	struct U* ; // 0x390(0x08)
	struct U* ; // 0x398(0x08)
	struct U* ; // 0x3a0(0x08)
	struct FLinearColor ; // 0x3a8(0x10)
	struct FLinearColor ; // 0x3b8(0x10)
	struct FLinearColor ; // 0x3c8(0x10)
	struct UImage* BackgroundImage_1; // 0x3d8(0x08)
	struct TArray<struct U*> ; // 0x3e0(0x10)
	int32_t ; // 0x3f0(0x04)

	void (int32_t& Num); // Function Widget_Ability_Element_Signature_KillCounter.. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void (int32_t& Num); // Function Widget_Ability_Element_Signature_KillCounter.. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void (bool Initialize); // Function Widget_Ability_Element_Signature_KillCounter.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_Signature_KillCounter.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_Signature_KillCounter.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (bool Initialize); // Function Widget_Ability_Element_Signature_KillCounter.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void OnStartWidget(); // Function Widget_Ability_Element_Signature_KillCounter..OnStartWidget // (BlueprintCosmetic|Event|Protected|BlueprintEvent) // @ game+0x3322a60
	void _1(); // Function Widget_Ability_Element_Signature_KillCounter.._1 // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function Widget_Ability_Element_Signature_KillCounter.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a60
};

