// WidgetBlueprintGeneratedClass Widget_Ability_Element_ChargeStandard.
// Size: 0x490 (Inherited: 0x358)
struct U : UCharacterAbilityWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x358(0x08)
	struct UImage* ; // 0x360(0x08)
	struct UImage* ; // 0x368(0x08)
	struct UTextBlock* ; // 0x370(0x08)
	struct UImage* ; // 0x378(0x08)
	struct UImage* Image_73; // 0x380(0x08)
	struct UImage* Image_75; // 0x388(0x08)
	struct UImage* Image_76; // 0x390(0x08)
	struct UImage* Image_77; // 0x398(0x08)
	struct UImage* Image_78; // 0x3a0(0x08)
	struct UImage* Image_79; // 0x3a8(0x08)
	struct UImage* Image_80; // 0x3b0(0x08)
	struct UImage* Image_81; // 0x3b8(0x08)
	struct UImage* Image_82; // 0x3c0(0x08)
	struct UHorizontalBox* ; // 0x3c8(0x08)
	struct UHorizontalBox* ; // 0x3d0(0x08)
	struct FMulticastInlineDelegate ; // 0x3d8(0x10)
	struct TArray<struct FStruct_AbilityChargeImages> ; // 0x3e8(0x10)
	struct FSlateColor ; // 0x3f8(0x28)
	struct FSlateColor ; // 0x420(0x28)
	struct FSlateColor ; // 0x448(0x28)
	struct TArray<struct FStruct_AbilityChargeImages> ; // 0x470(0x10)
	struct UProgressBar* ; // 0x480(0x08)
	struct UComp_Ability_CooldownComponent_C* CooldownComponent; // 0x488(0x08)

	void (); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void GetPipCost(int32_t& PipCost); // Function Widget_Ability_Element_ChargeStandard..GetPipCost // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void (int32_t PipCost, bool ); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t& CurrentCharges); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void (int32_t& MaxCharges); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_ChargeStandard.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	int32_t (int32_t ); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void (int32_t Charges, int32_t MaxCharges, int32_t ); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	int32_t (); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	int32_t GetPermanentCharges(); // Function Widget_Ability_Element_ChargeStandard..GetPermanentCharges // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t Charges, int32_t MaxCharges, int32_t ); // Function Widget_Ability_Element_ChargeStandard.. // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct UUserWidget* ); // Function Widget_Ability_Element_ChargeStandard.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct UUserWidget* ); // Function Widget_Ability_Element_ChargeStandard.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_ChargeStandard.. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void OnStartWidget(); // Function Widget_Ability_Element_ChargeStandard..OnStartWidget // (BlueprintCosmetic|Event|Protected|BlueprintEvent) // @ game+0x3322a60
	void _1(); // Function Widget_Ability_Element_ChargeStandard.._1 // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct FStruct_GameplayTagAndHUD_Info TagInfo); // Function Widget_Ability_Element_ChargeStandard.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (struct FStruct_GameplayTagAndHUD_Info TagInfo); // Function Widget_Ability_Element_ChargeStandard.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_ChargeStandard.. // (BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
	void (int32_t EntryPoint); // Function Widget_Ability_Element_ChargeStandard.. // (Final|UbergraphFunction|HasDefaults) // @ game+0x3322a60
	void (); // Function Widget_Ability_Element_ChargeStandard.. // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x3322a60
};

