// BlueprintGeneratedClass Ability_Base.Ability_Base_C
// Size: 0xfd1 (Inherited: 0xed0)
struct AAbility_Base_C : AAresEquippable {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xed0(0x08)
	struct UAbilityTrackingComponent* AbilityTrackingComponent; // 0xed8(0x08)
	struct URespondToEventStateComponent* RespondToEventState; // 0xee0(0x08)
	struct UCharacterAbilityStatisticsComponent_C* CharacterAbilityStatisticsComponent; // 0xee8(0x08)
	struct FEmbeddedEffectInfo FXC_EquippedSettings; // 0xef0(0x30)
	struct FEffectID FXC_Equipped_ID; // 0xf20(0x20)
	struct UCharacterAbilityWidget* AbilityHUDWidgetClass; // 0xf40(0x08)
	struct UCharacterAbilityWidget* AbilityHUDWidget; // 0xf48(0x08)
	struct FMulticastInlineDelegate DispatchUpdateAbilityWidget; // 0xf50(0x10)
	bool OnCooldown; // 0xf60(0x01)
	char pad_F61[0x7]; // 0xf61(0x07)
	struct FMulticastInlineDelegate PlayFrontIconAnim; // 0xf68(0x10)
	struct FMulticastInlineDelegate PlayBackIconAnim; // 0xf78(0x10)
	bool PlayEquipAnimation; // 0xf88(0x01)
	char pad_F89[0x3]; // 0xf89(0x03)
	int32_t CurrentCharge; // 0xf8c(0x04)
	bool PlayResourceConsumeAnimation; // 0xf90(0x01)
	char pad_F91[0x7]; // 0xf91(0x07)
	struct FMulticastInlineDelegate PlayRechargeAnim; // 0xf98(0x10)
	bool OutOfChargesOnCooldown; // 0xfa8(0x01)
	char pad_FA9[0x7]; // 0xfa9(0x07)
	struct FMulticastInlineDelegate TimerStarted; // 0xfb0(0x10)
	struct FMulticastInlineDelegate AbilityHUD_Setup; // 0xfc0(0x10)
	bool DisabledFeedbackCooldown; // 0xfd0(0x01)
};

