// WidgetBlueprintGeneratedClass Announcement_ULTReady.Announcement_ULTReady_C
// Size: 0x488 (Inherited: 0x2ce)
struct UAnnouncement_ULTReady_C : UBaseAnnouncementWidget_C {
	char pad_2CE[0x2]; // 0x2ce(0x02)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2d0(0x08)
	struct UWidgetAnimation* Anim_IN_1; // 0x2d8(0x08)
	struct UWidgetAnimation* Anim_OUT; // 0x2e0(0x08)
	struct UWidgetAnimation* Anim_IN; // 0x2e8(0x08)
	struct UImage* bar_left; // 0x2f0(0x08)
	struct UImage* bar_right; // 0x2f8(0x08)
	struct UBorder* BrushNormal; // 0x300(0x08)
	struct UImage* Ether; // 0x308(0x08)
	struct UImage* LeftBar; // 0x310(0x08)
	struct UTextBlock* PrimaryText; // 0x318(0x08)
	struct UImage* RightBar; // 0x320(0x08)
	struct UTextBlock* SecondaryText; // 0x328(0x08)
	struct UImage* ULTIconImage; // 0x330(0x08)
	struct AShooterCharacter* Character; // 0x338(0x08)
	struct FText Secondary_text; // 0x340(0x18)
	struct AActor* actorForLocationText; // 0x358(0x08)
	struct FText Money; // 0x360(0x18)
	struct FText RoundNumber; // 0x378(0x18)
	struct FText Objective; // 0x390(0x18)
	struct FText SideSwap; // 0x3a8(0x18)
	struct FText UltName; // 0x3c0(0x18)
	struct UMaterialInstance* Icon Material; // 0x3d8(0x08)
	struct FSlateBrush UltIcon; // 0x3e0(0x90)
	struct FText Primary_text; // 0x470(0x18)
};

