// BlueprintGeneratedClass BaseGameMode.BaseGameMode_C
// Size: 0x9d0 (Inherited: 0x880)
struct ABaseGameMode_C : AShooterGameMode {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x880(0x08)
	struct UComp_GameMode_KillVO_C* Comp_GameMode_KillVO; // 0x888(0x08)
	struct UGameStateGameOverComponent_C* GameStateGameOverComponent; // 0x890(0x08)
	struct UGameStateSetupComponent_C* GameStateSetupComponent; // 0x898(0x08)
	struct UGameStateIntroComponent_C* GameStateIntroComponent; // 0x8a0(0x08)
	struct UGameStateLoadInComponent_C* GameStateLoadInComponent; // 0x8a8(0x08)
	struct UBombTeamComponent* RedBombTeam; // 0x8b0(0x08)
	struct UBombTeamComponent* BlueBombTeam; // 0x8b8(0x08)
	struct UBaseGameStateComponent* GameStateAwaitingShutdown; // 0x8c0(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x8c8(0x08)
	struct UAudBaseGameModeVOComponent_C* AudGameModeVOComponentClass; // 0x8d0(0x08)
	struct UAudBaseGameModeVOComponent_C* AudGameModeVOComponent; // 0x8d8(0x08)
	struct TArray<struct AShooterPlayerState*> PlayersToSpawn; // 0x8e0(0x10)
	struct TArray<float> PlayerSpawnTimes; // 0x8f0(0x10)
	float RespawnDelay; // 0x900(0x04)
	char pad_904[0x4]; // 0x904(0x04)
	struct USpawnPointPlayerSpawner* SpawnPointSpawn; // 0x908(0x08)
	float CorpseLifetime; // 0x910(0x04)
	char pad_914[0x4]; // 0x914(0x04)
	struct TArray<struct AGameObject*> Domes; // 0x918(0x10)
	struct TArray<struct AGameObject*> SoundBarriers; // 0x928(0x10)
	struct TArray<struct AGameObject*> BarrierVFX; // 0x938(0x10)
	struct FMulticastInlineDelegate OnLevelStreamingComplete; // 0x948(0x10)
	struct TSet<struct AShooterPlayerState*> SuccessfullySpawnedPlayers; // 0x958(0x50)
	enum class EMatchCompletionState MatchCompletionState; // 0x9a8(0x01)
	bool IsGameEnding; // 0x9a9(0x01)
	char pad_9AA[0x6]; // 0x9aa(0x06)
	struct UBaseTeamComponent* WinningTeam; // 0x9b0(0x08)
	bool bPlayCharDeathmatchWinVO; // 0x9b8(0x01)
	bool bIsNPE; // 0x9b9(0x01)
	bool bAllowAbilitySharing; // 0x9ba(0x01)
	char pad_9BB[0x5]; // 0x9bb(0x05)
	struct FMulticastInlineDelegate AuthWinRoundEvent2; // 0x9c0(0x10)
};

