// BlueprintGeneratedClass BombDestination.BombDestination_C
// Size: 0x518 (Inherited: 0x400)
struct ABombDestination_C : AGameObject {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x400(0x08)
	struct UReplicationSleepComponent* ReplicationSleep; // 0x408(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x410(0x08)
	struct UUsableComponent* Usable; // 0x418(0x08)
	struct AAresEquippable* BombEquippableClass; // 0x420(0x08)
	struct TArray<struct ABP_BombDestinationVolume_C*> RequiredPlantVolumes; // 0x428(0x10)
	bool L_FoundValidVolume; // 0x438(0x01)
	char pad_439[0x3]; // 0x439(0x03)
	float PlantRadius; // 0x43c(0x04)
	enum class BombSiteEnum BombSite; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct TArray<struct ABombSiteEffectObject_C*> BombSiteEffectActors; // 0x448(0x10)
	struct TArray<struct ABombSiteEffectObject_C*> ActiveEffects; // 0x458(0x10)
	struct TArray<struct ABombSiteEffectObject_C*> DeferredEffectReferences; // 0x468(0x10)
	struct TArray<float> DeferredEffectTimes; // 0x478(0x10)
	struct TArray<int32_t> RemoveIndexes; // 0x488(0x10)
	struct FActiveGameplayEffectHandle BombBuffV2; // 0x498(0x08)
	struct TArray<struct UPrimitiveComponent*> DestinationZoneAsPrimitiveComponents; // 0x4a0(0x10)
	struct FMulticastInlineDelegate OnBombPlanted; // 0x4b0(0x10)
	struct APlantedBomb_C* PlantedBomb; // 0x4c0(0x08)
	struct APlantedBomb_C* PlantedBombClass; // 0x4c8(0x08)
	struct AAresEquippable* PreviousEquippable; // 0x4d0(0x08)
	bool bCanBeginPlant; // 0x4d8(0x01)
	char pad_4D9[0x7]; // 0x4d9(0x07)
	struct FTimerHandle EquipBombTimer; // 0x4e0(0x08)
	struct TArray<struct FVector> PossibleBombOffsets; // 0x4e8(0x10)
	struct TArray<struct AActor*> NewVar_1; // 0x4f8(0x10)
	float PlantStepDown; // 0x508(0x04)
	float PlantStepUp; // 0x50c(0x04)
	float BombHalfHeight; // 0x510(0x04)
	float BombRadius; // 0x514(0x04)
};

