// BlueprintGeneratedClass Comp_BombEvents.Comp_BombEvents_C
// Size: 0x1c0 (Inherited: 0xe8)
struct UComp_BombEvents_C : UActorComponent {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xe8(0x08)
	struct FMulticastInlineDelegate OnBombPlanted; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnBombDefused; // 0x100(0x10)
	struct FMulticastInlineDelegate OnBombDefuseStart; // 0x110(0x10)
	struct FMulticastInlineDelegate OnBombDefuseStop; // 0x120(0x10)
	struct FMulticastInlineDelegate OnBombPlantStart; // 0x130(0x10)
	struct FMulticastInlineDelegate OnBombPlantCancelled; // 0x140(0x10)
	struct FMulticastInlineDelegate OnBombPickedUp; // 0x150(0x10)
	struct FMulticastInlineDelegate OnBombDropped; // 0x160(0x10)
	struct FMulticastInlineDelegate OnBombDefuserKilled; // 0x170(0x10)
	struct FMulticastInlineDelegate OnBombPlanterKilled; // 0x180(0x10)
	struct FMulticastInlineDelegate OnBombCarrierKilled; // 0x190(0x10)
	struct FMulticastInlineDelegate OnBombExploded; // 0x1a0(0x10)
	struct FMulticastInlineDelegate OnBombStateChanged; // 0x1b0(0x10)
};

