// WidgetBlueprintGeneratedClass ConfirmationModal.ConfirmationModal_C
// Size: 0x510 (Inherited: 0x478)
struct UConfirmationModal_C : UGenericModalNotification_Base_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x478(0x08)
	struct USpacer* CancelButtonSpacer; // 0x480(0x08)
	struct UNamedSlot* CustomBody; // 0x488(0x08)
	struct UWidgetSwitcher* CustomBodyOrMessage; // 0x490(0x08)
	struct UImage* Image_1; // 0x498(0x08)
	struct UImage* Image_2; // 0x4a0(0x08)
	struct UImage* Image_3; // 0x4a8(0x08)
	struct UImage* Image_4; // 0x4b0(0x08)
	struct UImage* Image_5; // 0x4b8(0x08)
	struct USharedButtonMaster_C* LeftButton; // 0x4c0(0x08)
	struct UTextBlock* Message; // 0x4c8(0x08)
	struct USharedButtonMaster_C* MiddleButton; // 0x4d0(0x08)
	struct USpacer* MiddleButtonSpacer; // 0x4d8(0x08)
	struct USharedButtonMaster_C* RightButton; // 0x4e0(0x08)
	struct USharedBackButton_C* SharedBackButton; // 0x4e8(0x08)
	struct USizeBox* SizeBoxCancel_2; // 0x4f0(0x08)
	struct USizeBox* SizeBoxConfirmation; // 0x4f8(0x08)
	struct USizeBox* SizeBoxMiddleButton; // 0x500(0x08)
	struct UTextBlock* Title; // 0x508(0x08)
};

