// AnimBlueprintGeneratedClass FP_Core_AnimGraph.FP_Core_AnimGraph_C
// Size: 0x5658 (Inherited: 0xe40)
struct UFP_Core_AnimGraph_C : UShooterCharacterAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xe40(0x08)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0xe48(0xd8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0xf20(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0xfa0(0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1070(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x10f0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1190(0x80)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x1210(0xd8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x12e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x1310(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x1338(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_10; // 0x13b8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1458(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x14d8(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1510(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_9; // 0x1590(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1630(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x16b0(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x16e8(0xe8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x17d0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x1928(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1a80(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x1b20(0x158)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x1c78(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x1d48(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1d78(0x80)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x1df8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x1e20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x1e48(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1e70(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_8; // 0x1ef0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x1f90(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x2010(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x2048(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x20c8(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x2100(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_7; // 0x2180(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x2220(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x22a0(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x22d8(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x23c0(0xd0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x2490(0x1c8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x2658(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x2720(0xd0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x27f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x2818(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x2840(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x2868(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x2890(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x28c8(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_6; // 0x2948(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x29e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x2a68(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2aa0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_5; // 0x2b20(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2bc0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2c40(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x2c78(0xe8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x2d60(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x2eb8(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3010(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x30b0(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3130(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x3150(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x31a0(0xc8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x3268(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x3298(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x32e8(0xc8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x33b0(0xd0)
	struct FAnimNode_RefPose AnimGraphNode_IdentityPose; // 0x3480(0x18)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x3498(0x50)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x34e8(0x110)
	char pad_35F8[0x8]; // 0x35f8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x3600(0x210)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x3810(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x3968(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x3998(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x39c8(0x30)
	char pad_39F8[0x8]; // 0x39f8(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x3a00(0x210)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x3c10(0x30)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3c40(0x38)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x3c78(0x30)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3ca8(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x3cc8(0x30)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3cf8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x3db8(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x3de8(0x110)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x3ef8(0x110)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x4008(0x110)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x4118(0x110)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x4228(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x4380(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x43b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x43e0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_4; // 0x4460(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x4500(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x4658(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x4688(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x47e0(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x4810(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x4840(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x4998(0x30)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x49c8(0x1c8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x4b90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x4bb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x4be0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x4c08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x4c30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x4c58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x4c80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x4ca8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x4cd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x4cf8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x4d20(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x4d58(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3; // 0x4dd8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x4e78(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x4ef8(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x4f30(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x4fb0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x5050(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x50d0(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x5108(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x5188(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5228(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x52a8(0x38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x52e0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5308(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5340(0xe8)
	struct AShooterCharacter* ShooterCharacterOwner; // 0x5428(0x08)
	float Direction; // 0x5430(0x04)
	float LeanBlendInFactor; // 0x5434(0x04)
	float LeanBlendOutFactor; // 0x5438(0x04)
	float TimetoRecover; // 0x543c(0x04)
	float TotalRecoveryDuration; // 0x5440(0x04)
	char pad_5444[0x4]; // 0x5444(0x04)
	struct UCurveFloat* WeaponRecoveryCurve; // 0x5448(0x08)
	float BlendTime; // 0x5450(0x04)
	char pad_5454[0x4]; // 0x5454(0x04)
	struct UCurveFloat* WeaponRecoveryCurveHeight; // 0x5458(0x08)
	float BlendTimeHeight; // 0x5460(0x04)
	char pad_5464[0x4]; // 0x5464(0x04)
	struct UCurveFloat* WeaponRecoveryCurveRot; // 0x5468(0x08)
	float BlendTimeRot; // 0x5470(0x04)
	char pad_5474[0x4]; // 0x5474(0x04)
	struct UCurveFloat* ProceduralLeanCurve; // 0x5478(0x08)
	float MaxMovementSpeedRunning; // 0x5480(0x04)
	float LeanAlpha; // 0x5484(0x04)
	float LeanDirection; // 0x5488(0x04)
	char pad_548C[0x4]; // 0x548c(0x04)
	struct UCurveFloat* WeaponFireSpreadCurve; // 0x5490(0x08)
	struct FVector ScopeOffsetFromRifleRoot; // 0x5498(0x0c)
	float PitchTranslationOffsetMod; // 0x54a4(0x04)
	float PitchRotationOffsetMod; // 0x54a8(0x04)
	float YawRotationOffsetMod; // 0x54ac(0x04)
	float YawTranslationOffsetMod; // 0x54b0(0x04)
	float GunKickBackAlpha2; // 0x54b4(0x04)
	bool HasADSMode; // 0x54b8(0x01)
	char pad_54B9[0x7]; // 0x54b9(0x07)
	struct FTransform ScopeTransformComponentSpace; // 0x54c0(0x30)
	float ForwardLeanDirection; // 0x54f0(0x04)
	float LeanAlphaForward; // 0x54f4(0x04)
	struct UCurveFloat* ProceduralLeanCurveForward; // 0x54f8(0x08)
	struct FVector FPGunOffsetHack; // 0x5500(0x0c)
	struct FRotator FPGunOffsetHackRotation; // 0x550c(0x0c)
	float GunKickBackDistance; // 0x5518(0x04)
	float GunKickBackAlpha; // 0x551c(0x04)
	float GunKickBackBlendOutTime; // 0x5520(0x04)
	float GunKickBackBlendInTime; // 0x5524(0x04)
	bool GunKickBackIsBlendingIn; // 0x5528(0x01)
	char pad_5529[0x3]; // 0x5529(0x03)
	float GunKickBackBlendTime; // 0x552c(0x04)
	bool GunKickBackIsBlendingOut; // 0x5530(0x01)
	char pad_5531[0x3]; // 0x5531(0x03)
	struct FVector LHandIKLocation; // 0x5534(0x0c)
	bool IsWeaponDown; // 0x5540(0x01)
	bool SetLHandIKLocation; // 0x5541(0x01)
	char pad_5542[0x2]; // 0x5542(0x02)
	float WeaponTransform_Override; // 0x5544(0x04)
	struct FVector WeaponTransform_Scale; // 0x5548(0x0c)
	struct FRotator WeaponTransform_Rotation; // 0x5554(0x0c)
	struct FVector WeaponTransform_Translation; // 0x5560(0x0c)
	float SpringStiffness; // 0x556c(0x04)
	float KickBackValueMult; // 0x5570(0x04)
	float SpringDamping; // 0x5574(0x04)
	struct FVector VFX_CameraLocation; // 0x5578(0x0c)
	float AimMultiplier; // 0x5584(0x04)
	float DebugMultForAimSpring; // 0x5588(0x04)
	float VelocityScaleForLeans; // 0x558c(0x04)
	float GunKickBackAlpha3; // 0x5590(0x04)
	struct FVector InaccuracyNoiseTranslation; // 0x5594(0x0c)
	struct FRotator InnaccuracyNoiseRotation; // 0x55a0(0x0c)
	struct FVector OnRopeOffset; // 0x55ac(0x0c)
	float GunKickBackBlendOutExponent; // 0x55b8(0x04)
	bool IsGunEquipped; // 0x55bc(0x01)
	char pad_55BD[0x3]; // 0x55bd(0x03)
	float ProceduralLowerAlpha; // 0x55c0(0x04)
	char pad_55C4[0x4]; // 0x55c4(0x04)
	struct FExplicitFloatCurve ProceduralLowerAlphaCurve; // 0x55c8(0x88)
	bool InvertLeans; // 0x5650(0x01)
	bool ProceduralIsZoomable; // 0x5651(0x01)
	char pad_5652[0x2]; // 0x5652(0x02)
	float ProceduralLeanAlpha; // 0x5654(0x04)
};

