// BlueprintGeneratedClass Gun_Zoomable.Gun_Zoomable_C
// Size: 0x1330 (Inherited: 0x1218)
struct AGun_Zoomable_C : AGun_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1218(0x08)
	struct UComp_Actor_MultiTargetHandler_Buff_C* Comp_Actor_MultiTargetHandler_Buff; // 0x1220(0x08)
	struct UComp_Gun_FlaggedZoomSettings_C* Comp_Gun_FlaggedZoomSettings; // 0x1228(0x08)
	struct UZoomLevelStateComponent* ZoomStateUnzoomedSkipTransition; // 0x1230(0x08)
	struct UPendingZoomLevelStateComponent* PendingZoomLevel2; // 0x1238(0x08)
	struct UPendingZoomLevelStateComponent* PendingZoomLevel1; // 0x1240(0x08)
	struct UZoomLevelStateComponent* ZoomStateInactive; // 0x1248(0x08)
	struct UZoomLevelStateComponent* ZoomStateLevel2; // 0x1250(0x08)
	struct UZoomLevelStateComponent* ZoomStateLevel1; // 0x1258(0x08)
	struct UZoomLevelStateComponent* ZoomStateUnzoomed; // 0x1260(0x08)
	struct UZoomLevelStateComponent* ZoomStateDisabled; // 0x1268(0x08)
	struct UEquippableStateMachineComponent* ZoomStateMachine; // 0x1270(0x08)
	struct UZoomManagerComponent* ZoomManagerComponent; // 0x1278(0x08)
	struct UCycleZoomState* CycleZoomState; // 0x1280(0x08)
	struct UZoomMultiplierComponent* ZoomMultiplier; // 0x1288(0x08)
	struct UBaseCrosshairHudElement* ZoomedCrosshair; // 0x1290(0x08)
	bool CanOverrideZoomedCrosshair; // 0x1298(0x01)
	char pad_1299[0x7]; // 0x1299(0x07)
	struct UBaseCrosshairHudElement* ZoomedCustomCrosshair; // 0x12a0(0x08)
	enum class AfterFiringWhileZoomedOption AfterFiringWhileZoomed; // 0x12a8(0x01)
	bool IsZoomable; // 0x12a9(0x01)
	char pad_12AA[0x6]; // 0x12aa(0x06)
	struct UAttachment_Base_Reflex_C* ReflexComponent; // 0x12b0(0x08)
	bool WeaponVisibility; // 0x12b8(0x01)
	bool IsAutoZoomQueued; // 0x12b9(0x01)
	char pad_12BA[0x2]; // 0x12ba(0x02)
	int32_t QueuedZoomLevel; // 0x12bc(0x04)
	bool ZoomCosmeticsEnable; // 0x12c0(0x01)
	bool CycleThroughZoomOnTriggerInput; // 0x12c1(0x01)
	bool ShouldAutoRescopeSniper; // 0x12c2(0x01)
	char pad_12C3[0x5]; // 0x12c3(0x05)
	struct FMulticastInlineDelegate OnZoomLevelReached; // 0x12c8(0x10)
	struct FMulticastInlineDelegate OnZoomStateReset; // 0x12d8(0x10)
	bool HasBegunInitialZoom; // 0x12e8(0x01)
	char pad_12E9[0x7]; // 0x12e9(0x07)
	struct TArray<struct UScriptStateComponent*> ValidZoomStates; // 0x12f0(0x10)
	struct TArray<struct UScriptStateComponent*> FiringStates; // 0x1300(0x10)
	struct TArray<struct UScriptStateComponent*> ValidZoomStatesWithReload; // 0x1310(0x10)
	float AutoPrimaryZoomRefireDelay; // 0x1320(0x04)
	bool CachedCanFireWhileZooming; // 0x1324(0x01)
	char pad_1325[0x3]; // 0x1325(0x03)
	struct AShooterCharacter* CurrentOwner; // 0x1328(0x08)
};

