// WidgetBlueprintGeneratedClass InitFailure.InitFailure_C
// Size: 0x308 (Inherited: 0x2c8)
struct UInitFailure_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UImage* BackgrounTint; // 0x2d0(0x08)
	struct UTextBlock* ErrorCode; // 0x2d8(0x08)
	struct UTextBlock* ErrorText; // 0x2e0(0x08)
	struct UInitDirectConnect_C* InitDirectConnect; // 0x2e8(0x08)
	struct USharedButtonMaster_C* LogoutShared; // 0x2f0(0x08)
	struct USharedButtonMaster_C* QuitShared; // 0x2f8(0x08)
	struct UTextBlock* TickerText; // 0x300(0x08)
};

