// BlueprintGeneratedClass PlantedBomb.PlantedBomb_C
// Size: 0x5d8 (Inherited: 0x400)
struct APlantedBomb_C : AGameObject {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x400(0x08)
	struct USphereComponent* PingCollider; // 0x408(0x08)
	struct UAIPerceptionStimuliSourceComponent* AIPerceptionStimuliSource; // 0x410(0x08)
	struct UTeamRoleComponent* TeamRole; // 0x418(0x08)
	struct UPlantedBombMinimapComponent_C* PlantedBombMinimapComponent; // 0x420(0x08)
	struct UGameObjectVisibilityComponent* GameObjectVisibility; // 0x428(0x08)
	struct UPlantedBombVOComponent_C* BombPlantVOComponent; // 0x430(0x08)
	struct UStaticMeshComponent* DefuseRangeIndicator; // 0x438(0x08)
	struct UCapsuleComponent* Capsule; // 0x440(0x08)
	struct URelevantFogOfWarComponent* RelevantFogOfWar; // 0x448(0x08)
	struct UCameraComponent* Camera; // 0x450(0x08)
	struct USpringArmComponent* SpringArm; // 0x458(0x08)
	struct UAresOutlineComponent* OutlineComponentSpikeMesh; // 0x460(0x08)
	struct UGameObjectMinimapDisplayComponentDeprecated* GameObjectMinimapDisplay; // 0x468(0x08)
	struct UStaticMeshComponent* SuperGrid_Plane; // 0x470(0x08)
	struct USkeletalMeshComponent* Bomb_Spike; // 0x478(0x08)
	struct UAresTextRenderComponent* AresTextRenderGhost0:00; // 0x480(0x08)
	struct UAresTextRenderComponent* AresTextRenderLeading0; // 0x488(0x08)
	struct UAresTextRenderComponent* AresTextRender1; // 0x490(0x08)
	struct USphereComponent* ExplodeInnerRadiusVisualizer; // 0x498(0x08)
	struct USphereComponent* ExplodeRadiusVisualizer; // 0x4a0(0x08)
	struct UUsableComponent* Usable; // 0x4a8(0x08)
	bool BombHasExploded; // 0x4b0(0x01)
	char pad_4B1[0x3]; // 0x4b1(0x03)
	float BombTickSecondsNormal; // 0x4b4(0x04)
	float BombTickSecondsFast; // 0x4b8(0x04)
	float BombTickSecondsFaster; // 0x4bc(0x04)
	float BombTickSecondsFastest; // 0x4c0(0x04)
	float BombTickSecondsDetonation; // 0x4c4(0x04)
	enum class EBombTickState BombTickState; // 0x4c8(0x01)
	char pad_4C9[0x3]; // 0x4c9(0x03)
	float BombExplodeOuterRadius; // 0x4cc(0x04)
	float BombExplodeInnerRadius; // 0x4d0(0x04)
	float TimeRemainingToExplode; // 0x4d4(0x04)
	float PlantedLocalTimeStamp; // 0x4d8(0x04)
	enum class BombSiteEnum PlantedAtSite; // 0x4dc(0x01)
	bool BombHasBeenDefused; // 0x4dd(0x01)
	char pad_4DE[0x2]; // 0x4de(0x02)
	struct FTimerHandle BombTickSpeed; // 0x4e0(0x08)
	enum class EBombTickState ClientPreviousBombTickState; // 0x4e8(0x01)
	enum class BombDefusingState BombDefuseState; // 0x4e9(0x01)
	char pad_4EA[0x6]; // 0x4ea(0x06)
	struct AShooterCharacter* CurrentDefuser; // 0x4f0(0x08)
	struct UAresAudioComponent* EventLongBeepSound; // 0x4f8(0x08)
	float DefuseProgress; // 0x500(0x04)
	float TimeUntilRemoveBombOutline; // 0x504(0x04)
	struct UMaterialInstanceDynamic* BombCoreMI; // 0x508(0x08)
	float BombExplodeTotalTime; // 0x510(0x04)
	int32_t CurrentDefuseSection; // 0x514(0x04)
	struct AEffectContainer* FXC Bomb While Defusing; // 0x518(0x08)
	struct AEffectContainer* FXC Bomb Defused; // 0x520(0x08)
	struct FMulticastInlineDelegate OnExploded; // 0x528(0x10)
	enum class EPlantedBombState PlantedBombState; // 0x538(0x01)
	char pad_539[0x7]; // 0x539(0x07)
	struct FMulticastInlineDelegate OnDefused; // 0x540(0x10)
	bool BombInitializeComplete; // 0x550(0x01)
	char pad_551[0x7]; // 0x551(0x07)
	struct AEffectContainer* BombBeepEffect; // 0x558(0x08)
	struct FEffectID FXC Bomb Defuse; // 0x560(0x20)
	float BombTickSpeed_Float; // 0x580(0x04)
	char pad_584[0x4]; // 0x584(0x04)
	struct AEffectContainer* BombMinimapExplosion; // 0x588(0x08)
	struct FEffectID TickingEffectID; // 0x590(0x20)
	struct TArray<struct FRotator> PossibleSpringArmPositions; // 0x5b0(0x10)
	int32_t BestSpringArmIndex; // 0x5c0(0x04)
	float BestSpringArmDistance; // 0x5c4(0x04)
	float BombBeepAttenuationRadius; // 0x5c8(0x04)
	float PredictedDefuseProgress; // 0x5cc(0x04)
	struct FTimerHandle ClientCorrectionTimer; // 0x5d0(0x08)
};

