// WidgetBlueprintGeneratedClass SignatureAbilityRechargedAnnouncementWidget.SignatureAbilityRechargedAnnouncementWidget_C
// Size: 0x328 (Inherited: 0x2ce)
struct USignatureAbilityRechargedAnnouncementWidget_C : UBaseAnnouncementWidget_C {
	char pad_2CE[0x2]; // 0x2ce(0x02)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2d0(0x08)
	struct UWidgetAnimation* Anim_OUT; // 0x2d8(0x08)
	struct UWidgetAnimation* Anim_IN; // 0x2e0(0x08)
	struct UImage* Brush_Normal; // 0x2e8(0x08)
	struct UImage* Image_72; // 0x2f0(0x08)
	struct UImage* L; // 0x2f8(0x08)
	struct UTextBlock* PrimaryText; // 0x300(0x08)
	struct UImage* R; // 0x308(0x08)
	struct USizeBox* SizeBox_1; // 0x310(0x08)
	struct AShooterCharacter* Character; // 0x318(0x08)
	struct AActor* actorForLocationText; // 0x320(0x08)
};

