// Class Slate.ButtonWidgetStyle
// Size: 0x2e0 (Inherited: 0x38)
struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FButtonStyle ButtonStyle; // 0x38(0x2a8)
};

// Class Slate.CheckBoxWidgetStyle
// Size: 0x618 (Inherited: 0x38)
struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FCheckBoxStyle CheckBoxStyle; // 0x38(0x5e0)
};

// Class Slate.ComboBoxWidgetStyle
// Size: 0x478 (Inherited: 0x38)
struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboBoxStyle ComboBoxStyle; // 0x38(0x440)
};

// Class Slate.ComboButtonWidgetStyle
// Size: 0x430 (Inherited: 0x38)
struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	struct FComboButtonStyle ComboButtonStyle; // 0x38(0x3f8)
};

// Class Slate.EditableTextBoxWidgetStyle
// Size: 0x8a0 (Inherited: 0x38)
struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextBoxStyle EditableTextBoxStyle; // 0x38(0x868)
};

// Class Slate.EditableTextWidgetStyle
// Size: 0x278 (Inherited: 0x38)
struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	struct FEditableTextStyle EditableTextStyle; // 0x38(0x240)
};

// Class Slate.ProgressWidgetStyle
// Size: 0x1f0 (Inherited: 0x38)
struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	struct FProgressBarStyle ProgressBarStyle; // 0x38(0x1b8)
};

// Class Slate.ScrollBarWidgetStyle
// Size: 0x550 (Inherited: 0x38)
struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBarStyle ScrollBarStyle; // 0x38(0x518)
};

// Class Slate.ScrollBoxWidgetStyle
// Size: 0x280 (Inherited: 0x38)
struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FScrollBoxStyle ScrollBoxStyle; // 0x38(0x248)
};

// Class Slate.SlateSettings
// Size: 0x38 (Inherited: 0x30)
struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Slate.SpinBoxWidgetStyle
// Size: 0x348 (Inherited: 0x38)
struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	struct FSpinBoxStyle SpinBoxStyle; // 0x38(0x310)
};

// Class Slate.TextBlockWidgetStyle
// Size: 0x2c8 (Inherited: 0x38)
struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	struct FTextBlockStyle TextBlockStyle; // 0x38(0x290)
};

// Class Slate.ToolMenuBase
// Size: 0x30 (Inherited: 0x30)
struct UToolMenuBase : UObject {
};

