// WidgetBlueprintGeneratedClass Widget_Ability_Element_Icon.Widget_Ability_Element_Icon_C
// Size: 0x3b0 (Inherited: 0x358)
struct UWidget_Ability_Element_Icon_C : UCharacterAbilityWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x358(0x08)
	struct UImage* AbilityIcon; // 0x360(0x08)
	struct UProgressBar* ProgressBar; // 0x368(0x08)
	struct UButton* TouchButton; // 0x370(0x08)
	struct FMulticastInlineDelegate DispatchUpdateWidget; // 0x378(0x10)
	struct UMaterialInstance* Icon_Material; // 0x388(0x08)
	struct UTexture* IconOverride; // 0x390(0x08)
	struct UTexture* EquippableIcon; // 0x398(0x08)
	struct UMaterialInstance* Suppressed Icon Template; // 0x3a0(0x08)
	struct UMaterialInstanceDynamic* MI Dynamic Suppressed Icon; // 0x3a8(0x08)
};

