// WidgetBlueprintGeneratedClass Widget_Ability_Standard.Widget_Ability_Standard_C
// Size: 0x459 (Inherited: 0x360)
struct UWidget_Ability_Standard_C : UWidget_Ability_Parent_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x360(0x08)
	struct UWidgetAnimation* TimerExpiring; // 0x368(0x08)
	struct UNamedSlot* AbilityIconSlot; // 0x370(0x08)
	struct UImage* BackAnimIcon; // 0x378(0x08)
	struct UImage* FrontAnimIcon; // 0x380(0x08)
	struct UGamepadInputPromptSwitcher_C* GamepadInputPromptSwitcher; // 0x388(0x08)
	struct UBorder* GamepadPromptBorder; // 0x390(0x08)
	struct UHorizontalBox* InputPromptHolder; // 0x398(0x08)
	struct UOverlay* Main; // 0x3a0(0x08)
	struct UNamedSlot* OverImageSlot; // 0x3a8(0x08)
	struct UImage* RechargeAnimIcon_2; // 0x3b0(0x08)
	struct UImage* Spacer; // 0x3b8(0x08)
	struct UImage* ThreeHolder; // 0x3c0(0x08)
	struct UVerticalBox* TimerVerticalBox; // 0x3c8(0x08)
	struct UImage* TwoHolder; // 0x3d0(0x08)
	struct UWidget_Ability_Element_ChargeStandard_C* Widget_Ability_ChargeStandard; // 0x3d8(0x08)
	struct UWidget_Ability_Element_InputPrompt_C* Widget_Ability_Element_InputPrompt; // 0x3e0(0x08)
	struct UWidget_Ability_Element_Signature_Cooldown_C* Widget_Ability_Element_Signature_Cooldown; // 0x3e8(0x08)
	struct UWidget_Ability_Element_Timer_C* Widget_Ability_Element_Timer; // 0x3f0(0x08)
	struct UWidget_Ability_Element_Icon_C* Widget_Ability_Icon; // 0x3f8(0x08)
	struct UWidget_Ability_Element_Key_C* Widget_Ability_Key_1; // 0x400(0x08)
	float BackIconTimeUpdateSpeed; // 0x408(0x04)
	char pad_40C[0x4]; // 0x40c(0x04)
	struct FTimerHandle BackIconTimer; // 0x410(0x08)
	struct FTimerHandle FrontIconTimer; // 0x418(0x08)
	float FrontIconUpdateSpeed; // 0x420(0x04)
	float BackIconStartTime; // 0x424(0x04)
	float FrontIconStartTime; // 0x428(0x04)
	float FrontIconDuration; // 0x42c(0x04)
	float BackIconDuration; // 0x430(0x04)
	float RechargeIconDuration; // 0x434(0x04)
	float RechargeIconUpdateSpeed; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	struct FTimerHandle RechargeIconTimer; // 0x440(0x08)
	float RechargeIconStartTime; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
	struct UMaterialInstance* Suppressed Icon Template; // 0x450(0x08)
	bool HideInputHolder; // 0x458(0x01)
};

