// BlueprintGeneratedClass AudBasePawnVOComponent.AudBasePawnVOComponent_C
// Size: 0x9da (Inherited: 0x178)
struct UAudBasePawnVOComponent_C : UBaseVOComponent_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x178(0x08)
	struct TArray<float> EmoteCooldownChargeTimestamps; // 0x180(0x10)
	float EmoteCooldownSeconds; // 0x190(0x04)
	float VO Emote Required Range; // 0x194(0x04)
	float VO Critical Required Range; // 0x198(0x04)
	bool KillStreakAliveCheck; // 0x19c(0x01)
	bool LastManStanding; // 0x19d(0x01)
	char pad_19E[0x2]; // 0x19e(0x02)
	int32_t ClutchPlayRoundNumber; // 0x1a0(0x04)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct TMap<enum class MatchVOEnum, struct UAkAudioEvent*> MatchVO; // 0x1a8(0x50)
	struct TMap<enum class CharacterRelationMatchVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificMatchVO; // 0x1f8(0x50)
	struct TMap<enum class MapRelationMatchVOEnum, struct FMapRelationshipInstance> MapSpecificMatchVO; // 0x248(0x50)
	struct TMap<enum class EmoteVOEnum, struct UAkAudioEvent*> EmoteVO; // 0x298(0x50)
	struct TMap<enum class CharacterRelationEmoteVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificEmoteVO; // 0x2e8(0x50)
	struct TMap<enum class RoundStartVOEnum, struct UAkAudioEvent*> RoundStartVO; // 0x338(0x50)
	struct TMap<enum class CharacterRelationRoundStartVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificRoundStartVO; // 0x388(0x50)
	struct TMap<enum class BubbleDownVOEnum, struct UAkAudioEvent*> BubbleDownVO; // 0x3d8(0x50)
	struct TMap<enum class CharacterRelationBubbleDownVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificBubbleDownVO; // 0x428(0x50)
	struct TMap<enum class EffortVOEnum, struct UAkAudioEvent*> EffortVO; // 0x478(0x50)
	struct TMap<enum class TacticalVOEnum, struct UAkAudioEvent*> TacticalVO; // 0x4c8(0x50)
	struct TMap<enum class RoundEndVOEnum, struct UAkAudioEvent*> RoundEndVO; // 0x518(0x50)
	struct TMap<enum class CharacterRelationRoundEndVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificRoundEndVO; // 0x568(0x50)
	struct TMap<enum class KillsVOEnum, struct UAkAudioEvent*> KillsVO; // 0x5b8(0x50)
	struct TMap<enum class CharacterRelationKillsVOEnum, struct FCharacterRelationshipInstance> CharacterSpecificKillVO; // 0x608(0x50)
	struct TMap<enum class AbilitiesVOEnum, struct UAkAudioEvent*> AbilitiesVO; // 0x658(0x50)
	struct TMap<struct UGameplayEffect*, struct UAkAudioEvent*> GameplayEffectKillEvents; // 0x6a8(0x50)
	struct TMap<struct UDamageType*, struct UAkAudioEvent*> DmgTypeKillEvents; // 0x6f8(0x50)
	struct TMap<enum class TagAllianceVOEnum, struct FTagInstance> CharacterTagRoundStartEvents; // 0x748(0x50)
	struct TMap<struct FName, struct UAkAudioEvent*> CharacterTagKillEvents; // 0x798(0x50)
	struct TMap<struct FName, struct UAkAudioEvent*> CharacterTagLastKillEvents; // 0x7e8(0x50)
	struct TMap<enum class CharacterRelationMatchVOEnum, struct FTagInstance> CharacterTagMatchStartEvents; // 0x838(0x50)
	struct TMap<enum class CharacterRelationBubbleDownVOEnum, struct FTagInstance> CharacterTagBubbleDownEvents; // 0x888(0x50)
	struct TMap<enum class CharacterRelationRoundStartVOEnum, struct FTagInstance> TagCommendRoundStartVO; // 0x8d8(0x50)
	struct TMap<enum class CharacterConvoVOEnum, struct FCharacterRelationshipInstance> CharacterConvoMatchStartVO; // 0x928(0x50)
	float EffortLastPlayedTime; // 0x978(0x04)
	float EffortCooldownSeconds; // 0x97c(0x04)
	struct FTimerHandle HealingReliefVOTimer; // 0x980(0x08)
	struct TMap<enum class DeathMatchVOEnum, struct UAkAudioEvent*> DeathMatchVO; // 0x988(0x50)
	bool HealingOnCooldown; // 0x9d8(0x01)
	bool IsBeingHealed; // 0x9d9(0x01)
};

