// BlueprintGeneratedClass BaseGameState.BaseGameState_C
// Size: 0xd38 (Inherited: 0xbe0)
struct ABaseGameState_C : AShooterGameState {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xbe0(0x08)
	struct UHUDVisibilityData* HUDVisibilityData; // 0xbe8(0x08)
	struct UComp_WidgetPool_C* Comp_WidgetPool; // 0xbf0(0x08)
	struct UComp_GameState_KillChampion_C* Comp_GameState_KillChampion; // 0xbf8(0x08)
	struct UComp_GameState_TrackedDebuffTags_C* Comp_GameState_TrackedDebuffTags; // 0xc00(0x08)
	struct UBaseGameplayNotificationSystemComp_C* GameplayNotificationSystemComp; // 0xc08(0x08)
	struct UComp_GameState_HUDEvents_C* Comp_GameState_HUDEvents; // 0xc10(0x08)
	struct ABlueprintTelemetryActor_C* BlueprintTelemetryActor; // 0xc18(0x08)
	int32_t MaxSides; // 0xc20(0x04)
	char pad_C24[0x4]; // 0xc24(0x04)
	struct TArray<struct FSlowTimeRequest> SlowTimeRequests; // 0xc28(0x10)
	float Temp_SlowTimeTransitionSpeed; // 0xc38(0x04)
	float Temp_TimeDilationGoal; // 0xc3c(0x04)
	float Temp_AfterDilation; // 0xc40(0x04)
	bool ActiveSlowTimeEffects; // 0xc44(0x01)
	char pad_C45[0x3]; // 0xc45(0x03)
	struct FMulticastInlineDelegate OnWaitingForPlayersChanged; // 0xc48(0x10)
	bool IsWaitingForPlayers; // 0xc58(0x01)
	char pad_C59[0x7]; // 0xc59(0x07)
	struct FMulticastInlineDelegate OnLevelStreamingComplete; // 0xc60(0x10)
	struct FMulticastInlineDelegate OnThreeSecCountdownStart; // 0xc70(0x10)
	struct FMulticastInlineDelegate OnFiveSecCountdownStart; // 0xc80(0x10)
	struct FText DefaultRoundNotifyText; // 0xc90(0x18)
	bool IsWarmupRound; // 0xca8(0x01)
	char pad_CA9[0x7]; // 0xca9(0x07)
	struct FMulticastInlineDelegate OnWarmupRoundChanged; // 0xcb0(0x10)
	bool ShowCharacterSpecificHUD; // 0xcc0(0x01)
	char pad_CC1[0x3]; // 0xcc1(0x03)
	float CorpseReplaceDelayOffset; // 0xcc4(0x04)
	int32_t DefaultScoreLimit; // 0xcc8(0x04)
	bool DisableEnemySpottedVO; // 0xccc(0x01)
	char pad_CCD[0x3]; // 0xccd(0x03)
	struct FMulticastInlineDelegate OnTeamsAdded; // 0xcd0(0x10)
	bool ThreeSecondCountdownTriggered; // 0xce0(0x01)
	bool FiveSecondCountdownTriggered; // 0xce1(0x01)
	struct FGameStateInfo GameStateInfo; // 0xce2(0x01)
	char pad_CE3[0x5]; // 0xce3(0x05)
	struct FMulticastInlineDelegate OnOvertimeRulesSet; // 0xce8(0x10)
	struct FMulticastInlineDelegate AlertThreatCompass; // 0xcf8(0x10)
	struct TSoftClassPtr<UObject> FootstepABTestClass; // 0xd08(0x30)
};

