// BlueprintGeneratedClass BasePawn.BasePawn_C
// Size: 0x1179 (Inherited: 0x1080)
struct ABasePawn_C : AShooterCharacter {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1080(0x08)
	struct UComp_PlayerCharacter_SpawnInvulnerability_C* Comp_PlayerCharacter_SpawnInvulnerability; // 0x1088(0x08)
	struct UCharacterPortraitMinimapComponent_C* CharacterPortraitMinimapComponent; // 0x1090(0x08)
	struct UShooterCharacterMinimapComponent_C* ShooterCharacterMinimapComponent; // 0x1098(0x08)
	struct UShooterCharacterVisibilityComponent* ShooterCharacterVisibility1; // 0x10a0(0x08)
	struct USplitBodyRotationRopeComponent* SplitBodyRotationRope; // 0x10a8(0x08)
	struct UAresOutlineComponent* OutlineOverlay1P; // 0x10b0(0x08)
	struct UAresOutlineComponent* OutlineCosmetic3P; // 0x10b8(0x08)
	struct UComp_CharacterFalling_C* Comp_CharacterFalling; // 0x10c0(0x08)
	struct UCosmeticActionsComponent_C* CosmeticActionsComponent; // 0x10c8(0x08)
	struct UComp_Actor_Concussable_C* Comp_Actor_Concussable; // 0x10d0(0x08)
	struct UParticleSystemComponent* UD_FakeShadow_VFX; // 0x10d8(0x08)
	struct UIgnoreAllyWallPenetrationComponent* IgnoreAllyWallPenetration; // 0x10e0(0x08)
	struct UMinimapVisionConesComponent* MinimapVision; // 0x10e8(0x08)
	struct UAIPerceptionStimuliSourceComponent* AIPerceptionStimuliSource; // 0x10f0(0x08)
	struct UAresOutlineComponent* Outline1P; // 0x10f8(0x08)
	struct UAresOutlineComponent* Outline3P; // 0x1100(0x08)
	struct FNone* InEditorHotkeyComponent; // 0x1108(0x08)
	struct UBaseMovementSoundComponent_C* BaseMovementSoundComponent; // 0x1110(0x08)
	struct USplitBodyRotationGroundComponent* SplitBodyRotationGround; // 0x1118(0x08)
	struct UShooterCharacterDeathReactionComponent* ShooterCharacterDeathReaction; // 0x1120(0x08)
	struct UCharacterHudManagerComponent* CharacterHudManager; // 0x1128(0x08)
	struct UChildDamageSectionComponent* ShieldDamageSection; // 0x1130(0x08)
	struct UChildDamageSectionComponent* HealthDamageSection; // 0x1138(0x08)
	struct UAresHUDListener* AresHUDListener; // 0x1140(0x08)
	struct UAudBasePawnVOComponent_C* AudBasePawnVOComponent; // 0x1148(0x08)
	struct TArray<struct UMaterialInterface*> DefaultMaterials; // 0x1150(0x10)
	struct UAud_Base_SFX_Component_C* AudBaseSFXComponentClass; // 0x1160(0x08)
	struct UAud_Base_SFX_Component_C* AudBaseSFXComponent; // 0x1168(0x08)
	struct UAud_Base_UI_Component_C* Aud_Base_UI_Component; // 0x1170(0x08)
	bool SkipPerceptionSystemRegister; // 0x1178(0x01)
};

