// BlueprintGeneratedClass BaseEjectable.BaseEjectable_C
// Size: 0x568 (Inherited: 0x520)
struct ABaseEjectable_C : AAresEjectable {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x520(0x08)
	struct UAresOutlineComponent* AresOutline3P; // 0x528(0x08)
	struct UAresOutlineComponent* AresOutline1P; // 0x530(0x08)
	struct UStaticMeshComponent* Mesh1P; // 0x538(0x08)
	struct UStaticMeshComponent* Mesh3P; // 0x540(0x08)
	struct UStaticMeshComponent* ActiveMesh; // 0x548(0x08)
	bool ApplyScaleOnGround; // 0x550(0x01)
	char pad_551[0x7]; // 0x551(0x07)
	struct UStaticMesh* Original Mesh 1P; // 0x558(0x08)
	struct UStaticMesh* Original Mesh 3P; // 0x560(0x08)
};

