// BlueprintGeneratedClass Comp_FXC_SwapMaterials.Comp_FXC_SwapMaterials_C
// Size: 0x183 (Inherited: 0xf8)
struct UComp_FXC_SwapMaterials_C : UEffectComponent {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xf8(0x08)
	struct AShooterCharacter* ShooterCharacter; // 0x100(0x08)
	struct UMaterialInstance* OverrideMaterial; // 0x108(0x08)
	bool UseDynamicMaterial; // 0x110(0x01)
	char pad_111[0x7]; // 0x111(0x07)
	struct UMaterialInstanceDynamic* DynamicMaterialInstance; // 0x118(0x08)
	bool HasAlreadyReset; // 0x120(0x01)
	bool SwapOnEffectStart; // 0x121(0x01)
	bool SwapBackOnStopEffect; // 0x122(0x01)
	char pad_123[0x5]; // 0x123(0x05)
	struct FMulticastInlineDelegate MaterialsSwapped; // 0x128(0x10)
	struct FMulticastInlineDelegate MaterialsReverted; // 0x138(0x10)
	bool MaterialsHaveBeenSwapped; // 0x148(0x01)
	char pad_149[0x7]; // 0x149(0x07)
	struct USkeletalMeshComponent* TargetMesh; // 0x150(0x08)
	bool ShouldSetTeamParameter; // 0x158(0x01)
	char pad_159[0x7]; // 0x159(0x07)
	struct TArray<struct FScalarParameterValue> FresnelScalarValues; // 0x160(0x10)
	struct TArray<struct FVectorParameterValue> FresnelVectorValues; // 0x170(0x10)
	bool CopyFresnelSettings; // 0x180(0x01)
	bool ManulSwapQueued; // 0x181(0x01)
	bool RequireSwappedMaterialActiveToSwapBack; // 0x182(0x01)
};

