// BlueprintGeneratedClass Comp_FXC_AudioBasic.Comp_FXC_AudioBasic_C
// Size: 0x172 (Inherited: 0xf8)
struct UComp_FXC_AudioBasic_C : UEffectComponent {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xf8(0x08)
	struct UBaseAudioComponent_C* AudioEmitter; // 0x100(0x08)
	struct UAkAudioEvent* PlayOnStart; // 0x108(0x08)
	bool MuteThirdPerson; // 0x110(0x01)
	bool AddTailForSound; // 0x111(0x01)
	bool EnableOcclusion; // 0x112(0x01)
	bool EndOnOwnerDeath; // 0x113(0x01)
	char pad_114[0x4]; // 0x114(0x04)
	struct FMulticastInlineDelegate OnAudioEmitterStarted; // 0x118(0x10)
	bool PostImmediatelty; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	struct UAkAudioEvent* PlayingEvent; // 0x130(0x08)
	int32_t FowHandle; // 0x138(0x04)
	bool MuteFirstPerson; // 0x13c(0x01)
	char pad_13D[0x3]; // 0x13d(0x03)
	struct TArray<struct AActor*> OcclusionIgnoreActors; // 0x140(0x10)
	struct UFogOfWarComponent* FogOfWarComponent; // 0x150(0x08)
	bool PlayEnemyAudioDuringPreRound; // 0x158(0x01)
	bool EnableDopplerRTPC; // 0x159(0x01)
	enum class Enum_AttenuationVisualization VisualizeAttenuation; // 0x15a(0x01)
	bool ContinuousOcclusion; // 0x15b(0x01)
	bool SetFacingAngle; // 0x15c(0x01)
	char pad_15D[0x3]; // 0x15d(0x03)
	int32_t MinSeekTime; // 0x160(0x04)
	char pad_164[0x4]; // 0x164(0x04)
	struct UObject* Context; // 0x168(0x08)
	bool MuteContext; // 0x170(0x01)
	bool MuteNonContext; // 0x171(0x01)
};

