// BlueprintGeneratedClass Comp_PlayerCharacter_Downed.Comp_PlayerCharacter_Downed_C
// Size: 0x1d0 (Inherited: 0xe8)
struct UComp_PlayerCharacter_Downed_C : UActorComponent {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xe8(0x08)
	float DownedTimeLimit; // 0xf0(0x04)
	float DefaultRecoveredHealth; // 0xf4(0x04)
	struct FMulticastInlineDelegate OnDowned; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnRecovered; // 0x108(0x10)
	struct UAresGameplayBuff* DownedDebuff; // 0x118(0x08)
	struct UAresGameplayBuff* DeathResistBuff; // 0x120(0x08)
	struct FActiveGameplayEffectHandle DeathResistHandle; // 0x128(0x08)
	struct FActiveGameplayEffectHandle DownedDebuffHandle; // 0x130(0x08)
	struct FTimerHandle DownedTimerHandle; // 0x138(0x08)
	bool bIsDowned; // 0x140(0x01)
	char pad_141[0x7]; // 0x141(0x07)
	struct FMulticastInlineDelegate OnDownedTimedOut; // 0x148(0x10)
	struct AGameObject_Downed_PickUpCharacterUsable_C* PickUpUsable; // 0x158(0x08)
	struct AGameObject_Downed_PickUpCharacterUsable_C* SpawnedPickUpUsable; // 0x160(0x08)
	struct UDamageResponse* DowningDamageResponse; // 0x168(0x08)
	struct FMulticastInlineDelegate OnPreDowned; // 0x170(0x10)
	struct AAresEquippable* DownedEquippable; // 0x180(0x08)
	struct AAresEquippable* DownedEquippableObject; // 0x188(0x08)
	struct UAresGameplayBuff* PreventSwitchingBuff; // 0x190(0x08)
	struct FActiveGameplayEffectHandle PreventSwitchingHandle; // 0x198(0x08)
	bool bWasDown; // 0x1a0(0x01)
	bool bShouldDie; // 0x1a1(0x01)
	char pad_1A2[0x6]; // 0x1a2(0x06)
	struct FMulticastInlineDelegate OnTimerPaused; // 0x1a8(0x10)
	struct FMulticastInlineDelegate OnTimerUnpaused; // 0x1b8(0x10)
	struct FActiveGameplayEffectHandle PreventFiringHandle; // 0x1c8(0x08)
};

