// BlueprintGeneratedClass Comp_FXC_SpawnParticle_ShooterCharacter.Comp_FXC_SpawnParticle_ShooterCharacter_C
// Size: 0x209 (Inherited: 0xf8)
struct UComp_FXC_SpawnParticle_ShooterCharacter_C : UEffectComponent {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xf8(0x08)
	struct UParticleSystemComponent* VFX_1P; // 0x100(0x08)
	struct UParticleSystemComponent* VFX_3P; // 0x108(0x08)
	struct UParticleSystem* EmitterTemplate1P; // 0x110(0x08)
	struct FName AttachPoint1P; // 0x118(0x0c)
	struct FVector EmitterOffset1P; // 0x124(0x0c)
	struct FRotator EmitterRotation1P; // 0x130(0x0c)
	struct FVector EmitterScale1P; // 0x13c(0x0c)
	bool Attach1PEffectToCamera; // 0x148(0x01)
	char pad_149[0x3]; // 0x149(0x03)
	float ParticleStartDelay1P; // 0x14c(0x04)
	float WarmupTime1P; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)
	struct FTimerHandle StartTimer1P; // 0x158(0x08)
	struct UParticleSystem* EmitterTemplate3P; // 0x160(0x08)
	struct FName AttachPoint3P; // 0x168(0x0c)
	struct FVector EmitterOffset3P; // 0x174(0x0c)
	struct FRotator EmitterRotation3P; // 0x180(0x0c)
	struct FVector EmitterScale3P; // 0x18c(0x0c)
	float ParticleStartDelay3P; // 0x198(0x04)
	float WarmupTime3P; // 0x19c(0x04)
	struct FTimerHandle StartTimer3P; // 0x1a0(0x08)
	enum class Struct_ParticleStopBehavior StopEffectBehavior; // 0x1a8(0x01)
	bool StopEmitterOnEffectStop; // 0x1a9(0x01)
	bool StopEmitterOnEffectEndPlay; // 0x1aa(0x01)
	bool AttachToCosmeticMesh; // 0x1ab(0x01)
	char pad_1AC[0x4]; // 0x1ac(0x04)
	struct FMulticastInlineDelegate OnEmitterSpawned1P; // 0x1b0(0x10)
	struct FMulticastInlineDelegate OnEmitterSpawned3P; // 0x1c0(0x10)
	struct FMulticastInlineDelegate OnPreEmitterSpawn1P; // 0x1d0(0x10)
	struct FMulticastInlineDelegate OnPreEmitterSpawn3P; // 0x1e0(0x10)
	bool DestroyEffectIfCameraSocketDoesNotExist; // 0x1f0(0x01)
	bool SpawnOnStartEffect; // 0x1f1(0x01)
	bool ParticlesActive; // 0x1f2(0x01)
	char pad_1F3[0x5]; // 0x1f3(0x05)
	struct AActor* Target; // 0x1f8(0x08)
	struct UObject* Context; // 0x200(0x08)
	bool ParticlesManuallyQueued; // 0x208(0x01)
};

