// WidgetBlueprintGeneratedClass DirectConnectWidget.DirectConnectWidget_C
// Size: 0x339 (Inherited: 0x2c8)
struct UDirectConnectWidget_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UEditableTextBox* Address; // 0x2d0(0x08)
	struct USharedSecondaryButtonText_C* Button; // 0x2d8(0x08)
	struct UComboBoxString* PlayerDropdown; // 0x2e0(0x08)
	struct UEditableTextBox* PlayerName; // 0x2e8(0x08)
	struct UHorizontalBox* PlayerNameBox; // 0x2f0(0x08)
	struct UHorizontalBox* PlayerWidget; // 0x2f8(0x08)
	struct UEditableTextBox* Port; // 0x300(0x08)
	struct UComboBoxString* TeamDropdown; // 0x308(0x08)
	struct UHorizontalBox* TeamWidget; // 0x310(0x08)
	struct FString DisplayName; // 0x318(0x10)
	struct FString PlayerGuid; // 0x328(0x10)
	bool Team; // 0x338(0x01)
};

