// Class EditableMesh.EditableMeshAdapter
// Size: 0x30 (Inherited: 0x30)
struct UEditableMeshAdapter : UObject {
};

// Class EditableMesh.EditableGeometryCollectionAdapter
// Size: 0xe0 (Inherited: 0x30)
struct UEditableGeometryCollectionAdapter : UEditableMeshAdapter {
	struct UGeometryCollection* GeometryCollection; // 0x30(0x08)
	struct UGeometryCollection* OriginalGeometryCollection; // 0x38(0x08)
	int32_t GeometryCollectionLODIndex; // 0x40(0x04)
	char pad_44[0x9c]; // 0x44(0x9c)
};

// Class EditableMesh.EditableMesh
// Size: 0x710 (Inherited: 0x30)
struct UEditableMesh : UObject {
	char pad_30[0x390]; // 0x30(0x390)
	struct TArray<struct UEditableMeshAdapter*> Adapters; // 0x3c0(0x10)
	char pad_3D0[0x8]; // 0x3d0(0x08)
	int32_t TextureCoordinateCount; // 0x3d8(0x04)
	char pad_3DC[0x148]; // 0x3dc(0x148)
	int32_t PendingCompactCounter; // 0x524(0x04)
	int32_t SubdivisionCount; // 0x528(0x04)
	char pad_52C[0x1e4]; // 0x52c(0x1e4)
};

// Class EditableMesh.EditableMeshFactory
// Size: 0x30 (Inherited: 0x30)
struct UEditableMeshFactory : UObject {
};

// Class EditableMesh.EditableStaticMeshAdapter
// Size: 0xe8 (Inherited: 0x30)
struct UEditableStaticMeshAdapter : UEditableMeshAdapter {
	struct UStaticMesh* StaticMesh; // 0x30(0x08)
	struct UStaticMesh* OriginalStaticMesh; // 0x38(0x08)
	int32_t StaticMeshLODIndex; // 0x40(0x04)
	char pad_44[0xa4]; // 0x44(0xa4)
};

