// AnimBlueprintGeneratedClass EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C
// Size: 0xce1 (Inherited: 0x300)
struct UEQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x300(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x308(0x38)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x340(0x50)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x390(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x408(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x430(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x458(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x4d8(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x510(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x590(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x5c8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x648(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x680(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x700(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x7c8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x848(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x880(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x900(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x9c8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xa48(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xa80(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb68(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xbe8(0xd0)
	int32_t BombStatus; // 0xcb8(0x04)
	bool Initialize Complete; // 0xcbc(0x01)
	char pad_CBD[0x3]; // 0xcbd(0x03)
	float Defuse Progress Bomb; // 0xcc0(0x04)
	float AdditivePlayRate; // 0xcc4(0x04)
	float Defuse Progress Stored; // 0xcc8(0x04)
	bool BombDefuseActive; // 0xccc(0x01)
	char pad_CCD[0x3]; // 0xccd(0x03)
	float Defuse Blend; // 0xcd0(0x04)
	float LastTimeWasDiffusing; // 0xcd4(0x04)
	float LastDiffuseProgress; // 0xcd8(0x04)
	float AnimationDecayDuration; // 0xcdc(0x04)
	bool BombEquippable?; // 0xce0(0x01)
};

