// BlueprintGeneratedClass Equippable_Unarmed.Equippable_Unarmed_C
// Size: 0xf10 (Inherited: 0xed0)
struct AEquippable_Unarmed_C : AAresEquippable {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xed0(0x08)
	struct UUsableUnequipStateComponent_C* UsableUnequipStateComponent; // 0xed8(0x08)
	struct UWhileDisarmedStateComponent* WhileDisarmedState; // 0xee0(0x08)
	struct UTimedStateComponent* CancelCommitState; // 0xee8(0x08)
	struct UTimedStateComponent* CompleteCommitState; // 0xef0(0x08)
	struct UWhileUsingUsableStateComponent* WhileUsingUsableState; // 0xef8(0x08)
	struct UEquipStateComponent* EquipState; // 0xf00(0x08)
	struct APlantedBomb_C* PlantedBomb; // 0xf08(0x08)
};

