// BlueprintGeneratedClass FXC_Buff_Vulnerable.FXC_Buff_Vulnerable_C
// Size: 0x590 (Inherited: 0x530)
struct AFXC_Buff_Vulnerable_C : AEffectContainer {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x530(0x08)
	struct UComp_FXC_AudioBasic_C* Comp_FXC_AudioBasic; // 0x538(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x540(0x08)
	struct UComp_FXC_HUD_Particle_C* Comp_FXC_HUD_Particle; // 0x548(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x550(0x08)
	float Timeline_1_Opacity_7FD3158E4BB4A5DC4798E1AD2A0C4F05; // 0x558(0x04)
	enum class ETimelineDirection Timeline_1__Direction_7FD3158E4BB4A5DC4798E1AD2A0C4F05; // 0x55c(0x01)
	char pad_55D[0x3]; // 0x55d(0x03)
	struct UTimelineComponent* Timeline_2; // 0x560(0x08)
	float Timeline_0_Opacity_B38A8C8D45CB03B87A2CE382D1BADAAD; // 0x568(0x04)
	enum class ETimelineDirection Timeline_0__Direction_B38A8C8D45CB03B87A2CE382D1BADAAD; // 0x56c(0x01)
	char pad_56D[0x3]; // 0x56d(0x03)
	struct UTimelineComponent* Timeline_1; // 0x570(0x08)
	struct AShooterCharacter* OwningShooterCharacter; // 0x578(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> Dynamic3P_Materials; // 0x580(0x10)
};

