// WidgetBlueprintGeneratedClass GamepadInputChordWidget.GamepadInputChordWidget_C
// Size: 0x310 (Inherited: 0x2c8)
struct UGamepadInputChordWidget_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UHorizontalBox* ChordedInputBox; // 0x2d0(0x08)
	struct UBorder* GamepadLeftInput; // 0x2d8(0x08)
	struct UBorder* GamepadRightInput; // 0x2e0(0x08)
	struct UTextBlock* GamepadShiftLinkText; // 0x2e8(0x08)
	struct UHorizontalBox* IconBox; // 0x2f0(0x08)
	struct UBorder* RootBorder; // 0x2f8(0x08)
	struct UGamepadInputIconBase* LeftInputIcon; // 0x300(0x08)
	struct UGamepadInputIconBase* RightInputIcon; // 0x308(0x08)
};

