// WidgetBlueprintGeneratedClass GenericModalNotification_Base.GenericModalNotification_Base_C
// Size: 0x478 (Inherited: 0x2c8)
struct UGenericModalNotification_Base_C : UModalNotificationWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c8(0x08)
	struct UWidgetAnimation* Intro; // 0x2d0(0x08)
	struct FMulticastInlineDelegate OnConfirmationPressed; // 0x2d8(0x10)
	struct FMulticastInlineDelegate OnMiddlePressed; // 0x2e8(0x10)
	struct FMulticastInlineDelegate OnCancelPressed; // 0x2f8(0x10)
	struct FText ConfirmationButtonText; // 0x308(0x18)
	struct FText MiddleButtonText; // 0x320(0x18)
	struct FText CancelButtonText; // 0x338(0x18)
	struct FText MessageText; // 0x350(0x18)
	struct FText TitleText; // 0x368(0x18)
	bool ShowMiddleButton; // 0x380(0x01)
	bool ShowCancelButton; // 0x381(0x01)
	bool UsingCustomBody; // 0x382(0x01)
	char pad_383[0x1]; // 0x383(0x01)
	struct FLinearColor RedColor; // 0x384(0x10)
	struct FLinearColor GreenColor; // 0x394(0x10)
	struct FLinearColor GrayColor; // 0x3a4(0x10)
	struct FLinearColor LightRedColor; // 0x3b4(0x10)
	struct FLinearColor DarkRedColor; // 0x3c4(0x10)
	struct FLinearColor WhiteColor; // 0x3d4(0x10)
	struct FLinearColor DarkBlueColor; // 0x3e4(0x10)
	enum class ButtonColors ConfirmButtonColor; // 0x3f4(0x01)
	enum class ButtonColors MiddleButtonColor; // 0x3f5(0x01)
	enum class ButtonColors CancelButtonColor; // 0x3f6(0x01)
	enum class TextColors TitleTextColor; // 0x3f7(0x01)
	enum class FillColors FillColor; // 0x3f8(0x01)
	enum class TextColors MessageTextColor; // 0x3f9(0x01)
	bool ShowCloseButton; // 0x3fa(0x01)
	bool ShowLeftButton; // 0x3fb(0x01)
	char pad_3FC[0x4]; // 0x3fc(0x04)
	struct UImage* BoundBackgroundImage; // 0x400(0x08)
	struct UTextBlock* BoundTitle; // 0x408(0x08)
	struct UWidgetSwitcher* BoundBodySwitcher; // 0x410(0x08)
	struct UNamedSlot* BoundCustomBody; // 0x418(0x08)
	struct UTextBlock* BoundMessage; // 0x420(0x08)
	struct USpacer* BoundCancelButtonSpacer; // 0x428(0x08)
	struct USharedButtonMaster_C* BoundLeftButton; // 0x430(0x08)
	struct USharedButtonMaster_C* BoundMiddleButton; // 0x438(0x08)
	struct USpacer* BoundMiddleButtonSpacer; // 0x440(0x08)
	struct USizeBox* BoundSizeBoxCancel; // 0x448(0x08)
	struct USharedButtonMaster_C* BoundRightButton; // 0x450(0x08)
	struct USharedBackButton_C* BoundSharedBackButton; // 0x458(0x08)
	struct USizeBox* BoundSizeBoxConfirmation; // 0x460(0x08)
	struct USizeBox* BoundSizeBoxMiddleButton; // 0x468(0x08)
	struct UVerticalBox* NewVar_1; // 0x470(0x08)
};

