// AnimBlueprintGeneratedClass Gun_Core_AnimGraph.Gun_Core_AnimGraph_C
// Size: 0xe3c (Inherited: 0x520)
struct UGun_Core_AnimGraph_C : UAresEquippableAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x520(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x528(0x38)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x560(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x600(0x50)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x650(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x678(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x6a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x6c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x6f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x718(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x740(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x768(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x790(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x7b8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x7e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x860(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x898(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x918(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x950(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x9d0(0x38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xa08(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xa30(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xab0(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xae8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xb68(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xba0(0xe8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xc88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xcb0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xcd8(0x38)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xd10(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xd48(0xe8)
	struct FRotator Mag Rotator; // 0xe30(0x0c)
};

