// WidgetBlueprintGeneratedClass Widget_Ability_Element_ChargeStandard.Widget_Ability_Element_ChargeStandard_C
// Size: 0x490 (Inherited: 0x358)
struct UWidget_Ability_Element_ChargeStandard_C : UCharacterAbilityWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x358(0x08)
	struct UImage* ChargeImage; // 0x360(0x08)
	struct UImage* ChargeImage_Extra; // 0x368(0x08)
	struct UTextBlock* ChargeNumberText; // 0x370(0x08)
	struct UImage* ChargeTexture; // 0x378(0x08)
	struct UImage* Image_73; // 0x380(0x08)
	struct UImage* Image_75; // 0x388(0x08)
	struct UImage* Image_76; // 0x390(0x08)
	struct UImage* Image_77; // 0x398(0x08)
	struct UImage* Image_78; // 0x3a0(0x08)
	struct UImage* Image_79; // 0x3a8(0x08)
	struct UImage* Image_80; // 0x3b0(0x08)
	struct UImage* Image_81; // 0x3b8(0x08)
	struct UImage* Image_82; // 0x3c0(0x08)
	struct UHorizontalBox* PipRectBox; // 0x3c8(0x08)
	struct UHorizontalBox* UltChargeBox; // 0x3d0(0x08)
	struct FMulticastInlineDelegate DispatchUpdateWidget; // 0x3d8(0x10)
	struct TArray<struct FStruct_AbilityChargeImages> ChargeImages; // 0x3e8(0x10)
	struct FSlateColor Suppressed Charge Tint; // 0x3f8(0x28)
	struct FSlateColor Base Charge Tint; // 0x420(0x28)
	struct FSlateColor BaseChargeTextureTint; // 0x448(0x28)
	struct TArray<struct FStruct_AbilityChargeImages> ChargeImagesRed; // 0x470(0x10)
	struct UProgressBar* UltProgressBar; // 0x480(0x08)
	struct UComp_Ability_CooldownComponent_C* CooldownComponent; // 0x488(0x08)
};

