// AnimBlueprintGeneratedClass Gun_Core_AnimGraph.Gun_Core_AnimGraph_C
// Size: 0xe3c (Inherited: 0x520)
struct UGun_Core_AnimGraph_C : UAresEquippableAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x520(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x528(0x38)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x560(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x600(0x50)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x650(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x678(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x6a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x6c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x6f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x718(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x740(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x768(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x790(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x7b8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x7e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x860(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x898(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x918(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x950(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x9d0(0x38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xa08(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xa30(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xab0(0x38)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xae8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xb68(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xba0(0xe8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xc88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xcb0(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xcd8(0x38)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xd10(0x38)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xd48(0xe8)
	struct FRotator Mag Rotator; // 0xe30(0x0c)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_67946DB844AB61D55E44788C36AFB620(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_67946DB844AB61D55E44788C36AFB620 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_2788A6924E95629BD64503A579686CF1(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_2788A6924E95629BD64503A579686CF1 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_A72B59154A8B2EB81A13E2936FD8F66E(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_A72B59154A8B2EB81A13E2936FD8F66E // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_58C9D93647361ED4692365A1B7A41E28(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_58C9D93647361ED4692365A1B7A41E28 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_726F55D849CAB9F2A220028F7BA34583(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_726F55D849CAB9F2A220028F7BA34583 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_43001C0443F069826F4CEFA06FD3F618(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_SequencePlayer_43001C0443F069826F4CEFA06FD3F618 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_1AA5BACA4DE468EF0D6720BCADBB2A89(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_1AA5BACA4DE468EF0D6720BCADBB2A89 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_6C93831C4669CF5EB2FB0CA5FC3FE0D6(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_6C93831C4669CF5EB2FB0CA5FC3FE0D6 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_62052FB4451E181A0BB0589D5369EEE7(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_62052FB4451E181A0BB0589D5369EEE7 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_D6AAAC8B48AD5CF7EF6EEEBFF7945E9D(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_D6AAAC8B48AD5CF7EF6EEEBFF7945E9D // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_C08E10B94EF91C96D68296B576FF1887(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_C08E10B94EF91C96D68296B576FF1887 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_EEAEAD544AF8176A5844A3BCFEBF7617(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_EEAEAD544AF8176A5844A3BCFEBF7617 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_928D2B1843F8C149C20CFCB0732A1CFC(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_928D2B1843F8C149C20CFCB0732A1CFC // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_53F520A046EEE557E0D36EAECCB78E13(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_53F520A046EEE557E0D36EAECCB78E13 // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_6E49144E4628E9C630857FB8EBD7BCFD(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_6E49144E4628E9C630857FB8EBD7BCFD // (BlueprintEvent) // @ game+0x3511190
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_C80A33EF412C68E180B5D2A8FD073655(); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Gun_Core_AnimGraph_AnimGraphNode_TransitionResult_C80A33EF412C68E180B5D2A8FD073655 // (BlueprintEvent) // @ game+0x3511190
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x3511190
	void ExecuteUbergraph_Gun_Core_AnimGraph(int32_t EntryPoint); // Function Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.ExecuteUbergraph_Gun_Core_AnimGraph // (Final|UbergraphFunction) // @ game+0x3511190
};

